leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef TMS570LC43X_PORTDEFS_H_
#define TMS570LC43X_PORTDEFS_H_

#define PWM_IOMM_KICK0 0xFFFF1C38
#define PWM_IOMM_KICK1 0xFFFF1C3C

/* Outputs */
#define PIN_FUNCTION_MIBSPI1CLK_F18_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1SOMI_0_G18_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1SIMO_0_F19_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_17_M4_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_21_T6_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_23_T8_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET1_14_A11_OUT PORT_FUNC0
#define PIN_FUNCTION_AD1EVT_N19_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_RX_ER_N19_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_RX_ER_N19_OUT PORT_FUNC3
#define PIN_FUNCTION_nTZ1_1_N19_OUT PORT_FUNC5
#define PIN_FUNCTION_EMIF_ADDR_00_D4_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_01_D4_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_ADDR_01_D5_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_03_D5_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_ADDR_06_C4_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_13_C4_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_11_C4_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_ADDR_07_C5_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_12_C5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_13_C5_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_ADDR_08_C6_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_11_C6_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_15_C6_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_ADDR_09_C7_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_10_C7_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_10_C8_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_09_C8_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_11_C9_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_08_C9_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_12_C10_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_06_C10_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_13_C11_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_05_C11_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_14_C12_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_04_C12_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_15_C13_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_03_C13_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_16_D14_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_02_D14_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_17_C14_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_01_C14_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_18_D15_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_00_D15_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_19_C15_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_nENA_C15_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_20_C16_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_nSYNC_C16_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_ADDR_21_C17_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_CLK_C17_OUT PORT_FUNC1
#define PIN_FUNCTION_EMIF_BA_1_D16_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_05_D16_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_CLK_K3_OUT PORT_FUNC1
#define PIN_FUNCTION_ECLK2_K3_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nCAS_R4_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_3_R4_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nCS_0_N17_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_15_N17_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_07_N17_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nCS_2_L17_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_4_L17_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nCS_3_K17_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_14_K17_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_09_K17_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nCSl_4_M17_OUT PORT_FUNC0
#define PIN_FUNCTION_RTP_DATA_07_M17_OUT PORT_FUNC1
#define PIN_FUNCTION_GIOB_5_M17_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nRAS_R3_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_6_R3_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nWAIT_P3_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_7_P3_OUT PORT_FUNC2
#define PIN_FUNCTION_EMIF_nWE_D17_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_RNW_D17_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_08_E9_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_05_E9_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_09_E8_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_04_E8_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_10_E7_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_03_E7_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_11_E6_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_02_E6_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_12_E13_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_BA_0_E13_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_13_E12_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nOE_E12_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_14_E11_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_1_E11_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_15_E10_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_0_E10_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_16_K15_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_00_K15_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_17_L15_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_01_L15_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_18_M15_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_02_M15_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_19_N15_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_03_N15_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_20_E5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_04_E5_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_21_F5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_05_F5_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_22_G5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_06_G5_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_23_K5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_07_K5_OUT PORT_FUNC1
#define PIN_FUNCTION_ETMDATA_24_L5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_08_L5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_24_L5_OUT PORT_FUNC2
#define PIN_FUNCTION_MIBSPI5NCS_4_L5_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMDATA_25_M5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_09_M5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_25_M5_OUT PORT_FUNC2
#define PIN_FUNCTION_MIBSPI5NCS_5_M5_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMDATA_26_N5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_10_N5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_26_N5_OUT PORT_FUNC2
#define PIN_FUNCTION_ETMDATA_27_P5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_11_P5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_27_P5_OUT PORT_FUNC2
#define PIN_FUNCTION_ETMDATA_28_R5_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_12_R5_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_28_R5_OUT PORT_FUNC2
#define PIN_FUNCTION_GIOA_0_R5_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMDATA_29_R6_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_13_R6_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_29_R6_OUT PORT_FUNC2
#define PIN_FUNCTION_GIOA_1_R6_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMDATA_30_R7_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_14_R7_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_30_R7_OUT PORT_FUNC2
#define PIN_FUNCTION_GIOA_3_R7_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMDATA_31_R8_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_15_R8_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_31_R8_OUT PORT_FUNC2
#define PIN_FUNCTION_GIOA_4_R8_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMTRACECLKIN_R9_OUT PORT_FUNC0
#define PIN_FUNCTION_EXTCLKIN2_R9_OUT PORT_FUNC1
#define PIN_FUNCTION_GIOA_5_R9_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMTRACECLKOUT_R10_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOA_6_R10_OUT PORT_FUNC3
#define PIN_FUNCTION_ETMTRACECTL_R11_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOA_7_R11_OUT PORT_FUNC3
#define PIN_FUNCTION_FRAYTX1_B15_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOA_2_B15_OUT PORT_FUNC3
#define PIN_FUNCTION_FRAYTX2_B8_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_0_B8_OUT PORT_FUNC3
#define PIN_FUNCTION_FRAYTXEN1_B16_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_1_B16_OUT PORT_FUNC3
#define PIN_FUNCTION_FRAYTXEN2_B9_OUT PORT_FUNC0
#define PIN_FUNCTION_GIOB_2_B9_OUT PORT_FUNC3
#define PIN_FUNCTION_GIOA_2_C1_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_00_C1_OUT PORT_FUNC2
#define PIN_FUNCTION_eQEP2I_C1_OUT PORT_FUNC5
#define PIN_FUNCTION_GIOA_3_E1_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_02_E1_OUT PORT_FUNC2
#define PIN_FUNCTION_GIOA_5_B5_OUT PORT_FUNC0
#define PIN_FUNCTION_EXTCLKIN_B5_OUT PORT_FUNC3
#define PIN_FUNCTION_ePWM1A_B5_OUT PORT_FUNC5
#define PIN_FUNCTION_GIOA_6_H3_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_04_H3_OUT PORT_FUNC2
#define PIN_FUNCTION_ePWM1B_H3_OUT PORT_FUNC5
#define PIN_FUNCTION_GIOA_7_M1_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_06_M1_OUT PORT_FUNC2
#define PIN_FUNCTION_ePWM2A_M1_OUT PORT_FUNC5
#define PIN_FUNCTION_GIOB_2_F2_OUT PORT_FUNC0
#define PIN_FUNCTION_DCAN4TX_F2_OUT PORT_FUNC3
#define PIN_FUNCTION_GIOB_3_W10_OUT PORT_FUNC0
#define PIN_FUNCTION_DCAN4RX_W10_OUT PORT_FUNC3
#define PIN_FUNCTION_GIOB_6_J2_OUT PORT_FUNC0
#define PIN_FUNCTION_nERROR1_J2_OUT PORT_FUNC1
#define PIN_FUNCTION_GIOB_7_F1_OUT PORT_FUNC0
#define PIN_FUNCTION_nERROR2_F1_OUT PORT_FUNC1
#define PIN_FUNCTION_nTZ1_2_F1_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI1NCS_0_R2_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1SOMI_1_R2_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TXD_2_R2_OUT PORT_FUNC2
#define PIN_FUNCTION_ECAP6_R2_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI1NCS_1_F3_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_COL_F3_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_17_F3_OUT PORT_FUNC3
#define PIN_FUNCTION_eQEP1S_F3_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI1NCS_2_G3_OUT PORT_FUNC0
#define PIN_FUNCTION_MDIO_G3_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_19_G3_OUT PORT_FUNC3
#define PIN_FUNCTION_MIBSPI1NCS_3_J3_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET1_21_J3_OUT PORT_FUNC3
#define PIN_FUNCTION_nTZ1_3_J3_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI1NENA_G19_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_2_G19_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_23_G19_OUT PORT_FUNC3
#define PIN_FUNCTION_ECAP4_G19_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3CLK_V9_OUT PORT_FUNC0
#define PIN_FUNCTION_EXT_SEL_01_V9_OUT PORT_FUNC1
#define PIN_FUNCTION_eQEP1A_V9_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3NCS_0_V10_OUT PORT_FUNC0
#define PIN_FUNCTION_AD2EVT_V10_OUT PORT_FUNC1
#define PIN_FUNCTION_eQEP1I_V10_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3NCS_1_V5_OUT PORT_FUNC0
#define PIN_FUNCTION_MDCLK_V5_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_25_V5_OUT PORT_FUNC3
#define PIN_FUNCTION_MIBSPI3NCS_2_B2_OUT PORT_FUNC0
#define PIN_FUNCTION_I2C1_SDA_B2_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_27_B2_OUT PORT_FUNC3
#define PIN_FUNCTION_nTZ1_2_B2_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3NCS_3_C3_OUT PORT_FUNC0
#define PIN_FUNCTION_I2C1_SCL_C3_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_29_C3_OUT PORT_FUNC3
#define PIN_FUNCTION_nTZ1_1_C3_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3NENA_W9_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_5_W9_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_31_W9_OUT PORT_FUNC3
#define PIN_FUNCTION_eQEP1B_W9_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3SIMO_W8_OUT PORT_FUNC0
#define PIN_FUNCTION_EXT_SEL_00_W8_OUT PORT_FUNC1
#define PIN_FUNCTION_ECAP3_W8_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI3SOMI_V8_OUT PORT_FUNC0
#define PIN_FUNCTION_EXT_ENA_V8_OUT PORT_FUNC1
#define PIN_FUNCTION_ECAP2_V8_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI5CLK_H19_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_04_H19_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TXEN_H19_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_TXEN_H19_OUT PORT_FUNC3
#define PIN_FUNCTION_MIBSPI5NCS_0_E19_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_05_E19_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM4A_E19_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI5NCS_1_B6_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_06_B6_OUT PORT_FUNC1
#define PIN_FUNCTION_MIBSPI5NCS_2_W6_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_02_W6_OUT PORT_FUNC1
#define PIN_FUNCTION_MIBSPI5NCS_3_T12_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_03_T12_OUT PORT_FUNC1
#define PIN_FUNCTION_MIBSPI5NENA_H18_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_07_H18_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_3_H18_OUT PORT_FUNC2
#define PIN_FUNCTION_ECAP5_H18_OUT PORT_FUNC5
#define PIN_FUNCTION_MIBSPI5SIMO_0_J19_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_08_J19_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TXD_1_J19_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_TXD_1_J19_OUT PORT_FUNC3
#define PIN_FUNCTION_MIBSPI5SIMO_1_E16_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_09_E16_OUT PORT_FUNC1
#define PIN_FUNCTION_EXT_SEL_00_E16_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SIMO_2_H17_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_10_H17_OUT PORT_FUNC1
#define PIN_FUNCTION_EXT_SEL_01_H17_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SIMO_3_G17_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_11_G17_OUT PORT_FUNC1
#define PIN_FUNCTION_I2C2_SDA_G17_OUT PORT_FUNC2
#define PIN_FUNCTION_EXT_SEL_02_G17_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SOMI_0_J18_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_12_J18_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TXD_0_J18_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_TXD_0_J18_OUT PORT_FUNC3
#define PIN_FUNCTION_MIBSPI5SOMI_1_E17_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_13_E17_OUT PORT_FUNC1
#define PIN_FUNCTION_EXT_SEL_03_E17_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SOMI_2_H16_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_14_H16_OUT PORT_FUNC1
#define PIN_FUNCTION_EXT_SEL_04_H16_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SOMI_3_G16_OUT PORT_FUNC0
#define PIN_FUNCTION_DMM_DATA_15_G16_OUT PORT_FUNC1
#define PIN_FUNCTION_I2C2_SCL_G16_OUT PORT_FUNC2
#define PIN_FUNCTION_EXT_ENA_G16_OUT PORT_FUNC4
#define PIN_FUNCTION_N2HET1_00_K18_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4CLK_K18_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM2B_K18_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_01_V2_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NENA_V2_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_08_V2_OUT PORT_FUNC3
#define PIN_FUNCTION_eQEP2A_V2_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_02_W5_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4SIMO_W5_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM3A_W5_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_03_U1_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_0_U1_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_10_U1_OUT PORT_FUNC3
#define PIN_FUNCTION_eQEP2B_U1_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_04_B12_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_1_B12_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM4B_B12_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_05_V6_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4SOMI_V6_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_12_V6_OUT PORT_FUNC3
#define PIN_FUNCTION_ePWM3B_V6_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_06_W3_OUT PORT_FUNC0
#define PIN_FUNCTION_SCI3RX_W3_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM5A_W3_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_07_T1_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_2_T1_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_14_T1_OUT PORT_FUNC3
#define PIN_FUNCTION_ePWM7B_T1_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_08_E18_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1SIMO_1_E18_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TXD_3_E18_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_09_V7_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_3_V7_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_16_V7_OUT PORT_FUNC3
#define PIN_FUNCTION_ePWM7A_V7_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_10_D19_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_4_D19_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_TX_CLK_D19_OUT PORT_FUNC2
#define PIN_FUNCTION_nTZ1_3_D19_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_11_E3_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_4_E3_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_18_E3_OUT PORT_FUNC3
#define PIN_FUNCTION_EPWM1SYNCO_E3_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_12_B4_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI4NCS_5_B4_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_CRS_B4_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_CRS_DV_B4_OUT PORT_FUNC3
#define PIN_FUNCTION_N2HET1_13_N2_OUT PORT_FUNC0
#define PIN_FUNCTION_SCI3TX_N2_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_20_N2_OUT PORT_FUNC3
#define PIN_FUNCTION_ePWM5B_N2_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_15_N1_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_4_N1_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_22_N1_OUT PORT_FUNC3
#define PIN_FUNCTION_ECAP1_N1_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_16_A4_OUT PORT_FUNC0
#define PIN_FUNCTION_EPWM1SYNCI_A4_OUT PORT_FUNC3
#define PIN_FUNCTION_EPWM1SYNCO_A4_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_17_A13_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nOE_A13_OUT PORT_FUNC1
#define PIN_FUNCTION_SCI4RX_A13_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_18_J1_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_RNW_J1_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM6A_J1_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_19_B13_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_0_B13_OUT PORT_FUNC1
#define PIN_FUNCTION_SCI4TX_B13_OUT PORT_FUNC2
#define PIN_FUNCTION_N2HET1_20_P2_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_1_P2_OUT PORT_FUNC1
#define PIN_FUNCTION_ePWM6B_P2_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET1_21_H4_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_2_H4_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_22_B3_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_nDQM_3_B3_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_23_J4_OUT PORT_FUNC0
#define PIN_FUNCTION_EMIF_BA_0_J4_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET1_24_P1_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_5_P1_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_0_P1_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_RXD_0_P1_OUT PORT_FUNC3
#define PIN_FUNCTION_N2HET1_26_A14_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_1_A14_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_RXD_1_A14_OUT PORT_FUNC3
#define PIN_FUNCTION_N2HET1_28_K19_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_RXCLK_K19_OUT PORT_FUNC2
#define PIN_FUNCTION_RMII_REFCLK_K19_OUT PORT_FUNC3
#define PIN_FUNCTION_N2HET1_30_B11_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_RX_DV_B11_OUT PORT_FUNC2
#define PIN_FUNCTION_eQEP2S_B11_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET2_01_D8_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_02_D7_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_12_D3_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI2NENA_D3_OUT PORT_FUNC4
#define PIN_FUNCTION_MIBSPI2NCS_1_D3_OUT PORT_FUNC5
#define PIN_FUNCTION_N2HET2_13_D2_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI2SOMI_D2_OUT PORT_FUNC4
#define PIN_FUNCTION_N2HET2_14_D1_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI2SIMO_D1_OUT PORT_FUNC4
#define PIN_FUNCTION_N2HET2_19_P4_OUT PORT_FUNC0
#define PIN_FUNCTION_LIN2RX_P4_OUT PORT_FUNC1
#define PIN_FUNCTION_N2HET2_20_T5_OUT PORT_FUNC0
#define PIN_FUNCTION_LIN2TX_T5_OUT PORT_FUNC1
#define PIN_FUNCTION_MII_RXCLK_T4_OUT PORT_FUNC0
#define PIN_FUNCTION_MII_TX_CLK_U7_OUT PORT_FUNC0
#define PIN_FUNCTION_N2HET2_03_E2_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI2CLK_E2_OUT PORT_FUNC4
#define PIN_FUNCTION_N2HET2_07_N3_OUT PORT_FUNC0
#define PIN_FUNCTION_MIBSPI2NCS_0_N3_OUT PORT_FUNC4

#define PIN_MIBSPI1CLK_F18_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1CLK_F18_OUT_REG_BIT 9
#define PIN_MIBSPI1CLK_F18_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1CLK_F18_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS


#define PIN_MIBSPI1SOMI_0_G18_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1SOMI_0_G18_OUT_REG_BIT 24
#define PIN_MIBSPI1SOMI_0_G18_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1SOMI_0_G18_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS


#define PIN_MIBSPI1SIMO_0_F19_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1SIMO_0_F19_OUT_REG_BIT 16
#define PIN_MIBSPI1SIMO_0_F19_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1SIMO_0_F19_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS


