leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET2_17_M4_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_17_M4_OUT_REG_BIT 17
#define PIN_N2HET2_17_M4_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_17_M4_OUT_REG_OFFSET 2


#define PIN_N2HET2_21_T6_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_21_T6_OUT_REG_BIT 21
#define PIN_N2HET2_21_T6_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_21_T6_OUT_REG_OFFSET 2


#define PIN_N2HET2_23_T8_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_23_T8_OUT_REG_BIT 23
#define PIN_N2HET2_23_T8_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_23_T8_OUT_REG_OFFSET 2


#define PIN_N2HET1_14_A11_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_14_A11_OUT_REG_BIT 14
#define PIN_N2HET1_14_A11_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_14_A11_OUT_REG_OFFSET 2


#define PIN_AD1EVT_N19_OUT_REG_BIT 0
#define PIN_AD1EVT_N19_OUT_REG_OFFSET 0

#define PIN_MII_RX_ER_N19_OUT_REG_BIT 2 
#define PIN_MII_RX_ER_N19_OUT_REG_OFFSET 0

#define PIN_RMII_RX_ER_N19_OUT_REG_BIT 3 
#define PIN_RMII_RX_ER_N19_OUT_REG_OFFSET 0

#define PIN_nTZ1_1_N19_OUT_REG_BIT 5
#define PIN_nTZ1_1_N19_OUT_REG_OFFSET 0

#define PIN_EMIF_ADDR_00_D4_OUT_REG_BIT 8 
#define PIN_EMIF_ADDR_00_D4_OUT_REG_OFFSET 0

#define PIN_N2HET2_01_D4_OUT_MULTI_REG_BIT 10

#define PIN_N2HET2_01_D4_OUT_REG_BIT 01
#define PIN_N2HET2_01_D4_OUT_MULTI_REG_OFFSET 0
#define PIN_N2HET2_01_D4_OUT_REG_OFFSET 2


#define PIN_EMIF_ADDR_01_D5_OUT_REG_BIT 16
#define PIN_EMIF_ADDR_01_D5_OUT_REG_OFFSET 0

#define PIN_N2HET2_03_D5_OUT_MULTI_REG_BIT 18

#define PIN_N2HET2_03_D5_OUT_REG_BIT 03
#define PIN_N2HET2_03_D5_OUT_MULTI_REG_OFFSET 0
#define PIN_N2HET2_03_D5_OUT_REG_OFFSET 2


#define PIN_EMIF_ADDR_06_C4_OUT_REG_BIT 24 
#define PIN_EMIF_ADDR_06_C4_OUT_REG_OFFSET 0

#define PIN_RTP_DATA_13_C4_OUT_REG_BIT 25 
#define PIN_RTP_DATA_13_C4_OUT_REG_OFFSET 0

#define PIN_N2HET2_11_C4_OUT_MULTI_REG_BIT 26

#define PIN_N2HET2_11_C4_OUT_REG_BIT 11
#define PIN_N2HET2_11_C4_OUT_MULTI_REG_OFFSET 0
#define PIN_N2HET2_11_C4_OUT_REG_OFFSET 2


#define PIN_EMIF_ADDR_07_C5_OUT_REG_BIT 0 
#define PIN_EMIF_ADDR_07_C5_OUT_REG_OFFSET 1

#define PIN_RTP_DATA_12_C5_OUT_REG_BIT 1 
#define PIN_RTP_DATA_12_C5_OUT_REG_OFFSET 1

#define PIN_N2HET2_13_C5_OUT_MULTI_REG_BIT 2

#define PIN_N2HET2_13_C5_OUT_REG_BIT 13
#define PIN_N2HET2_13_C5_OUT_MULTI_REG_OFFSET 1
#define PIN_N2HET2_13_C5_OUT_REG_OFFSET 2


#define PIN_EMIF_ADDR_08_C6_OUT_REG_BIT 8 
#define PIN_EMIF_ADDR_08_C6_OUT_REG_OFFSET 1

#define PIN_RTP_DATA_11_C6_OUT_REG_BIT 9 
#define PIN_RTP_DATA_11_C6_OUT_REG_OFFSET 1

#define PIN_N2HET2_15_C6_OUT_MULTI_REG_BIT 10

#define PIN_N2HET2_15_C6_OUT_REG_BIT 15
#define PIN_N2HET2_15_C6_OUT_MULTI_REG_OFFSET 1
#define PIN_N2HET2_15_C6_OUT_REG_OFFSET 2


#define PIN_EMIF_ADDR_09_C7_OUT_REG_BIT 16 
#define PIN_EMIF_ADDR_09_C7_OUT_REG_OFFSET 1

#define PIN_RTP_DATA_10_C7_OUT_REG_BIT 17
#define PIN_RTP_DATA_10_C7_OUT_REG_OFFSET 1

#define PIN_EMIF_ADDR_10_C8_OUT_REG_BIT 24 
#define PIN_EMIF_ADDR_10_C8_OUT_REG_OFFSET 1

#define PIN_RTP_DATA_09_C8_OUT_REG_BIT 25
#define PIN_RTP_DATA_09_C8_OUT_REG_OFFSET 1

#define PIN_EMIF_ADDR_11_C9_OUT_REG_BIT 0 
#define PIN_EMIF_ADDR_11_C9_OUT_REG_OFFSET 2

#define PIN_RTP_DATA_08_C9_OUT_REG_BIT 1
#define PIN_RTP_DATA_08_C9_OUT_REG_OFFSET 2

#define PIN_EMIF_ADDR_12_C10_OUT_REG_BIT 8 
#define PIN_EMIF_ADDR_12_C10_OUT_REG_OFFSET 2

#define PIN_RTP_DATA_06_C10_OUT_REG_BIT 9
#define PIN_RTP_DATA_06_C10_OUT_REG_OFFSET 2

#define PIN_EMIF_ADDR_13_C11_OUT_REG_BIT 16 
#define PIN_EMIF_ADDR_13_C11_OUT_REG_OFFSET 2

#define PIN_RTP_DATA_05_C11_OUT_REG_BIT 17
#define PIN_RTP_DATA_05_C11_OUT_REG_OFFSET 2

#define PIN_EMIF_ADDR_14_C12_OUT_REG_BIT 24 
#define PIN_EMIF_ADDR_14_C12_OUT_REG_OFFSET 2

#define PIN_RTP_DATA_04_C12_OUT_REG_BIT 25
#define PIN_RTP_DATA_04_C12_OUT_REG_OFFSET 2

#define PIN_EMIF_ADDR_15_C13_OUT_REG_BIT 0 
#define PIN_EMIF_ADDR_15_C13_OUT_REG_OFFSET 3

#define PIN_RTP_DATA_03_C13_OUT_REG_BIT 1
#define PIN_RTP_DATA_03_C13_OUT_REG_OFFSET 3

#define PIN_EMIF_ADDR_16_D14_OUT_REG_BIT 8 
#define PIN_EMIF_ADDR_16_D14_OUT_REG_OFFSET 3

#define PIN_RTP_DATA_02_D14_OUT_REG_BIT 9
#define PIN_RTP_DATA_02_D14_OUT_REG_OFFSET 3

#define PIN_EMIF_ADDR_17_C14_OUT_REG_BIT 16 
#define PIN_EMIF_ADDR_17_C14_OUT_REG_OFFSET 3

#define PIN_RTP_DATA_01_C14_OUT_REG_BIT 17
#define PIN_RTP_DATA_01_C14_OUT_REG_OFFSET 3

#define PIN_EMIF_ADDR_18_D15_OUT_REG_BIT 24 
#define PIN_EMIF_ADDR_18_D15_OUT_REG_OFFSET 3

#define PIN_RTP_DATA_00_D15_OUT_REG_BIT 25
#define PIN_RTP_DATA_00_D15_OUT_REG_OFFSET 3

#define PIN_EMIF_ADDR_19_C15_OUT_REG_BIT 0 
#define PIN_EMIF_ADDR_19_C15_OUT_REG_OFFSET 4

#define PIN_RTP_nENA_C15_OUT_REG_BIT 1
#define PIN_RTP_nENA_C15_OUT_REG_OFFSET 4

#define PIN_EMIF_ADDR_20_C16_OUT_REG_BIT 8 
#define PIN_EMIF_ADDR_20_C16_OUT_REG_OFFSET 4

#define PIN_RTP_nSYNC_C16_OUT_REG_BIT 9
#define PIN_RTP_nSYNC_C16_OUT_REG_OFFSET 4

#define PIN_EMIF_ADDR_21_C17_OUT_REG_BIT 16 
#define PIN_EMIF_ADDR_21_C17_OUT_REG_OFFSET 4

#define PIN_RTP_CLK_C17_OUT_REG_BIT 17
#define PIN_RTP_CLK_C17_OUT_REG_OFFSET 4

#define PIN_EMIF_BA_1_D16_OUT_REG_BIT 24
#define PIN_EMIF_BA_1_D16_OUT_REG_OFFSET 8

#define PIN_N2HET2_05_D16_OUT_MULTI_REG_BIT 26

#define PIN_N2HET2_05_D16_OUT_REG_BIT 05
#define PIN_N2HET2_05_D16_OUT_MULTI_REG_OFFSET 8
#define PIN_N2HET2_05_D16_OUT_REG_OFFSET 2


#define PIN_EMIF_CLK_K3_OUT_REG_BIT 1 
#define PIN_EMIF_CLK_K3_OUT_REG_OFFSET 9

#define PIN_ECLK2_K3_OUT_REG_BIT 2
#define PIN_ECLK2_K3_OUT_REG_OFFSET 9

#define PIN_EMIF_nCAS_R4_OUT_REG_BIT 8 
#define PIN_EMIF_nCAS_R4_OUT_REG_OFFSET 9

#define PIN_GIOB_3_R4_OUT_MULTI_REG_BIT 10

#define PIN_GIOB_3_R4_OUT_REG_BIT 3
#define PIN_GIOB_3_R4_OUT_MULTI_REG_OFFSET 9
#define PIN_GIOB_3_R4_OUT_REG_OFFSET 1


