leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_EMIF_nCS_0_N17_OUT_REG_BIT 16 
#define PIN_EMIF_nCS_0_N17_OUT_REG_OFFSET 9

#define PIN_RTP_DATA_15_N17_OUT_REG_BIT 17 
#define PIN_RTP_DATA_15_N17_OUT_REG_OFFSET 9

#define PIN_N2HET2_07_N17_OUT_MULTI_REG_BIT 18

#define PIN_N2HET2_07_N17_OUT_REG_BIT 07
#define PIN_N2HET2_07_N17_OUT_MULTI_REG_OFFSET 9
#define PIN_N2HET2_07_N17_OUT_REG_OFFSET 2


#define PIN_EMIF_nCS_2_L17_OUT_REG_BIT 24 
#define PIN_EMIF_nCS_2_L17_OUT_REG_OFFSET 9

#define PIN_GIOB_4_L17_OUT_MULTI_REG_BIT 26

#define PIN_GIOB_4_L17_OUT_REG_BIT 4
#define PIN_GIOB_4_L17_OUT_MULTI_REG_OFFSET 9
#define PIN_GIOB_4_L17_OUT_REG_OFFSET 1


#define PIN_EMIF_nCS_3_K17_OUT_REG_BIT 0 
#define PIN_EMIF_nCS_3_K17_OUT_REG_OFFSET 10

#define PIN_RTP_DATA_14_K17_OUT_REG_BIT 1 
#define PIN_RTP_DATA_14_K17_OUT_REG_OFFSET 10

#define PIN_N2HET2_09_K17_OUT_MULTI_REG_BIT 2

#define PIN_N2HET2_09_K17_OUT_REG_BIT 09
#define PIN_N2HET2_09_K17_OUT_MULTI_REG_OFFSET 10
#define PIN_N2HET2_09_K17_OUT_REG_OFFSET 2


#define PIN_EMIF_nCSl_4_M17_OUT_REG_BIT 8 
#define PIN_EMIF_nCSl_4_M17_OUT_REG_OFFSET 10

#define PIN_RTP_DATA_07_M17_OUT_REG_BIT 9 
#define PIN_RTP_DATA_07_M17_OUT_REG_OFFSET 10

#define PIN_GIOB_5_M17_OUT_MULTI_REG_BIT 10

#define PIN_GIOB_5_M17_OUT_REG_BIT 5
#define PIN_GIOB_5_M17_OUT_MULTI_REG_OFFSET 10
#define PIN_GIOB_5_M17_OUT_REG_OFFSET 1


#define PIN_EMIF_nRAS_R3_OUT_REG_BIT 16 
#define PIN_EMIF_nRAS_R3_OUT_REG_OFFSET 10

#define PIN_GIOB_6_R3_OUT_MULTI_REG_BIT 18

#define PIN_GIOB_6_R3_OUT_REG_BIT 6
#define PIN_GIOB_6_R3_OUT_MULTI_REG_OFFSET 10
#define PIN_GIOB_6_R3_OUT_REG_OFFSET 1


#define PIN_EMIF_nWAIT_P3_OUT_REG_BIT 24 
#define PIN_EMIF_nWAIT_P3_OUT_REG_OFFSET 10

#define PIN_GIOB_7_P3_OUT_MULTI_REG_BIT 26

#define PIN_GIOB_7_P3_OUT_REG_BIT 7
#define PIN_GIOB_7_P3_OUT_MULTI_REG_OFFSET 10
#define PIN_GIOB_7_P3_OUT_REG_OFFSET 1


#define PIN_EMIF_nWE_D17_OUT_REG_BIT 0 
#define PIN_EMIF_nWE_D17_OUT_REG_OFFSET 11

#define PIN_EMIF_RNW_D17_OUT_REG_BIT 1
#define PIN_EMIF_RNW_D17_OUT_REG_OFFSET 11

#define PIN_ETMDATA_08_E9_OUT_REG_BIT 8 
#define PIN_ETMDATA_08_E9_OUT_REG_OFFSET 11

#define PIN_EMIF_ADDR_05_E9_OUT_REG_BIT 9
#define PIN_EMIF_ADDR_05_E9_OUT_REG_OFFSET 11

#define PIN_ETMDATA_09_E8_OUT_REG_BIT 16 
#define PIN_ETMDATA_09_E8_OUT_REG_OFFSET 11

#define PIN_EMIF_ADDR_04_E8_OUT_REG_BIT 17
#define PIN_EMIF_ADDR_04_E8_OUT_REG_OFFSET 11

#define PIN_ETMDATA_10_E7_OUT_REG_BIT 24 
#define PIN_ETMDATA_10_E7_OUT_REG_OFFSET 11

#define PIN_EMIF_ADDR_03_E7_OUT_REG_BIT 25
#define PIN_EMIF_ADDR_03_E7_OUT_REG_OFFSET 11

#define PIN_ETMDATA_11_E6_OUT_REG_BIT 0 
#define PIN_ETMDATA_11_E6_OUT_REG_OFFSET 12

#define PIN_EMIF_ADDR_02_E6_OUT_REG_BIT 1
#define PIN_EMIF_ADDR_02_E6_OUT_REG_OFFSET 12

#define PIN_ETMDATA_12_E13_OUT_REG_BIT 8 
#define PIN_ETMDATA_12_E13_OUT_REG_OFFSET 12

#define PIN_EMIF_BA_0_E13_OUT_REG_BIT 9
#define PIN_EMIF_BA_0_E13_OUT_REG_OFFSET 12

#define PIN_ETMDATA_13_E12_OUT_REG_BIT 16 
#define PIN_ETMDATA_13_E12_OUT_REG_OFFSET 12

#define PIN_EMIF_nOE_E12_OUT_REG_BIT 17
#define PIN_EMIF_nOE_E12_OUT_REG_OFFSET 12

#define PIN_ETMDATA_14_E11_OUT_REG_BIT 24 
#define PIN_ETMDATA_14_E11_OUT_REG_OFFSET 12

#define PIN_EMIF_nDQM_1_E11_OUT_REG_BIT 25
#define PIN_EMIF_nDQM_1_E11_OUT_REG_OFFSET 12

#define PIN_ETMDATA_15_E10_OUT_REG_BIT 0 
#define PIN_ETMDATA_15_E10_OUT_REG_OFFSET 13

#define PIN_EMIF_nDQM_0_E10_OUT_REG_BIT 1
#define PIN_EMIF_nDQM_0_E10_OUT_REG_OFFSET 13

#define PIN_ETMDATA_16_K15_OUT_REG_BIT 8 
#define PIN_ETMDATA_16_K15_OUT_REG_OFFSET 13

#define PIN_EMIF_DATA_00_K15_OUT_REG_BIT 9
#define PIN_EMIF_DATA_00_K15_OUT_REG_OFFSET 13

#define PIN_ETMDATA_17_L15_OUT_REG_BIT 16 
#define PIN_ETMDATA_17_L15_OUT_REG_OFFSET 13

#define PIN_EMIF_DATA_01_L15_OUT_REG_BIT 17
#define PIN_EMIF_DATA_01_L15_OUT_REG_OFFSET 13

#define PIN_ETMDATA_18_M15_OUT_REG_BIT 24 
#define PIN_ETMDATA_18_M15_OUT_REG_OFFSET 13

#define PIN_EMIF_DATA_02_M15_OUT_REG_BIT 25
#define PIN_EMIF_DATA_02_M15_OUT_REG_OFFSET 13

#define PIN_ETMDATA_19_N15_OUT_REG_BIT 0 
#define PIN_ETMDATA_19_N15_OUT_REG_OFFSET 14

#define PIN_EMIF_DATA_03_N15_OUT_REG_BIT 1
#define PIN_EMIF_DATA_03_N15_OUT_REG_OFFSET 14

#define PIN_ETMDATA_20_E5_OUT_REG_BIT 8 
#define PIN_ETMDATA_20_E5_OUT_REG_OFFSET 14

#define PIN_EMIF_DATA_04_E5_OUT_REG_BIT 9
#define PIN_EMIF_DATA_04_E5_OUT_REG_OFFSET 14

#define PIN_ETMDATA_21_F5_OUT_REG_BIT 16 
#define PIN_ETMDATA_21_F5_OUT_REG_OFFSET 14

#define PIN_EMIF_DATA_05_F5_OUT_REG_BIT 17
#define PIN_EMIF_DATA_05_F5_OUT_REG_OFFSET 14

#define PIN_ETMDATA_22_G5_OUT_REG_BIT 24 
#define PIN_ETMDATA_22_G5_OUT_REG_OFFSET 14

#define PIN_EMIF_DATA_06_G5_OUT_REG_BIT 25
#define PIN_EMIF_DATA_06_G5_OUT_REG_OFFSET 14

#define PIN_ETMDATA_23_K5_OUT_REG_BIT 0 
#define PIN_ETMDATA_23_K5_OUT_REG_OFFSET 15

#define PIN_EMIF_DATA_07_K5_OUT_REG_BIT 1
#define PIN_EMIF_DATA_07_K5_OUT_REG_OFFSET 15

#define PIN_ETMDATA_24_L5_OUT_REG_BIT 8 
#define PIN_ETMDATA_24_L5_OUT_REG_OFFSET 15

#define PIN_EMIF_DATA_08_L5_OUT_REG_BIT 9 
#define PIN_EMIF_DATA_08_L5_OUT_REG_OFFSET 15

#define PIN_N2HET2_24_L5_OUT_MULTI_REG_BIT 10 

#define PIN_N2HET2_24_L5_OUT_REG_BIT 24
#define PIN_N2HET2_24_L5_OUT_MULTI_REG_OFFSET 15
#define PIN_N2HET2_24_L5_OUT_REG_OFFSET 2


#define PIN_MIBSPI5NCS_4_L5_OUT_MULTI_REG_BIT 11

#define PIN_MIBSPI5NCS_4_L5_OUT_REG_BIT 4
#define PIN_MIBSPI5NCS_4_L5_OUT_MULTI_REG_OFFSET 15
#define PIN_MIBSPI5NCS_4_L5_OUT_REG_OFFSET 15


#define PIN_ETMDATA_25_M5_OUT_REG_BIT 16 
#define PIN_ETMDATA_25_M5_OUT_REG_OFFSET 15

#define PIN_EMIF_DATA_09_M5_OUT_REG_BIT 17 
#define PIN_EMIF_DATA_09_M5_OUT_REG_OFFSET 15

#define PIN_N2HET2_25_M5_OUT_MULTI_REG_BIT 18 

#define PIN_N2HET2_25_M5_OUT_REG_BIT 25
#define PIN_N2HET2_25_M5_OUT_MULTI_REG_OFFSET 15
#define PIN_N2HET2_25_M5_OUT_REG_OFFSET 2


#define PIN_MIBSPI5NCS_5_M5_OUT_MULTI_REG_BIT 19

#define PIN_MIBSPI5NCS_5_M5_OUT_REG_BIT 5
#define PIN_MIBSPI5NCS_5_M5_OUT_MULTI_REG_OFFSET 15
#define PIN_MIBSPI5NCS_5_M5_OUT_REG_OFFSET 15


#define PIN_ETMDATA_26_N5_OUT_REG_BIT 24 
#define PIN_ETMDATA_26_N5_OUT_REG_OFFSET 15

#define PIN_EMIF_DATA_10_N5_OUT_REG_BIT 25 
#define PIN_EMIF_DATA_10_N5_OUT_REG_OFFSET 15

#define PIN_N2HET2_26_N5_OUT_MULTI_REG_BIT 26

#define PIN_N2HET2_26_N5_OUT_REG_BIT 26
#define PIN_N2HET2_26_N5_OUT_MULTI_REG_OFFSET 15
#define PIN_N2HET2_26_N5_OUT_REG_OFFSET 2


#define PIN_ETMDATA_27_P5_OUT_REG_BIT 0 
#define PIN_ETMDATA_27_P5_OUT_REG_OFFSET 16

#define PIN_EMIF_DATA_11_P5_OUT_REG_BIT 1 
#define PIN_EMIF_DATA_11_P5_OUT_REG_OFFSET 16

