leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET2_27_P5_OUT_MULTI_REG_BIT 2

#define PIN_N2HET2_27_P5_OUT_REG_BIT 27
#define PIN_N2HET2_27_P5_OUT_MULTI_REG_OFFSET 16
#define PIN_N2HET2_27_P5_OUT_REG_OFFSET 2


#define PIN_ETMDATA_28_R5_OUT_REG_BIT 8 
#define PIN_ETMDATA_28_R5_OUT_REG_OFFSET 16

#define PIN_EMIF_DATA_12_R5_OUT_REG_BIT 9 
#define PIN_EMIF_DATA_12_R5_OUT_REG_OFFSET 16

#define PIN_N2HET2_28_R5_OUT_MULTI_REG_BIT 10 

#define PIN_N2HET2_28_R5_OUT_REG_BIT 28
#define PIN_N2HET2_28_R5_OUT_MULTI_REG_OFFSET 16
#define PIN_N2HET2_28_R5_OUT_REG_OFFSET 2


#define PIN_GIOA_0_R5_OUT_MULTI_REG_BIT 11

#define PIN_GIOA_0_R5_OUT_REG_BIT 0
#define PIN_GIOA_0_R5_OUT_MULTI_REG_OFFSET 16
#define PIN_GIOA_0_R5_OUT_REG_OFFSET 0


#define PIN_ETMDATA_29_R6_OUT_REG_BIT 16 
#define PIN_ETMDATA_29_R6_OUT_REG_OFFSET 16

#define PIN_EMIF_DATA_13_R6_OUT_REG_BIT 17 
#define PIN_EMIF_DATA_13_R6_OUT_REG_OFFSET 16

#define PIN_N2HET2_29_R6_OUT_MULTI_REG_BIT 18 

#define PIN_N2HET2_29_R6_OUT_REG_BIT 29
#define PIN_N2HET2_29_R6_OUT_MULTI_REG_OFFSET 16
#define PIN_N2HET2_29_R6_OUT_REG_OFFSET 2


#define PIN_GIOA_1_R6_OUT_MULTI_REG_BIT 19

#define PIN_GIOA_1_R6_OUT_REG_BIT 1
#define PIN_GIOA_1_R6_OUT_MULTI_REG_OFFSET 16
#define PIN_GIOA_1_R6_OUT_REG_OFFSET 0


#define PIN_ETMDATA_30_R7_OUT_REG_BIT 24 
#define PIN_ETMDATA_30_R7_OUT_REG_OFFSET 16

#define PIN_EMIF_DATA_14_R7_OUT_REG_BIT 25 
#define PIN_EMIF_DATA_14_R7_OUT_REG_OFFSET 16

#define PIN_N2HET2_30_R7_OUT_MULTI_REG_BIT 26 

#define PIN_N2HET2_30_R7_OUT_REG_BIT 30
#define PIN_N2HET2_30_R7_OUT_MULTI_REG_OFFSET 16
#define PIN_N2HET2_30_R7_OUT_REG_OFFSET 2


#define PIN_GIOA_3_R7_OUT_MULTI_REG_BIT 27

#define PIN_GIOA_3_R7_OUT_REG_BIT 3
#define PIN_GIOA_3_R7_OUT_MULTI_REG_OFFSET 16
#define PIN_GIOA_3_R7_OUT_REG_OFFSET 0


#define PIN_ETMDATA_31_R8_OUT_REG_BIT 0 
#define PIN_ETMDATA_31_R8_OUT_REG_OFFSET 17

#define PIN_EMIF_DATA_15_R8_OUT_REG_BIT 1 
#define PIN_EMIF_DATA_15_R8_OUT_REG_OFFSET 17

#define PIN_N2HET2_31_R8_OUT_MULTI_REG_BIT 2 

#define PIN_N2HET2_31_R8_OUT_REG_BIT 31
#define PIN_N2HET2_31_R8_OUT_MULTI_REG_OFFSET 17
#define PIN_N2HET2_31_R8_OUT_REG_OFFSET 2


#define PIN_GIOA_4_R8_OUT_MULTI_REG_BIT 3

#define PIN_GIOA_4_R8_OUT_REG_BIT 4
#define PIN_GIOA_4_R8_OUT_MULTI_REG_OFFSET 17
#define PIN_GIOA_4_R8_OUT_REG_OFFSET 0


#define PIN_ETMTRACECLKIN_R9_OUT_REG_BIT 8 
#define PIN_ETMTRACECLKIN_R9_OUT_REG_OFFSET 17

#define PIN_EXTCLKIN2_R9_OUT_REG_BIT 9 
#define PIN_EXTCLKIN2_R9_OUT_REG_OFFSET 17

#define PIN_GIOA_5_R9_OUT_MULTI_REG_BIT 11

#define PIN_GIOA_5_R9_OUT_REG_BIT 5
#define PIN_GIOA_5_R9_OUT_MULTI_REG_OFFSET 17
#define PIN_GIOA_5_R9_OUT_REG_OFFSET 0


#define PIN_ETMTRACECLKOUT_R10_OUT_REG_BIT 16 
#define PIN_ETMTRACECLKOUT_R10_OUT_REG_OFFSET 17

#define PIN_GIOA_6_R10_OUT_MULTI_REG_BIT 19

#define PIN_GIOA_6_R10_OUT_REG_BIT 6
#define PIN_GIOA_6_R10_OUT_MULTI_REG_OFFSET 17
#define PIN_GIOA_6_R10_OUT_REG_OFFSET 0


#define PIN_ETMTRACECTL_R11_OUT_REG_BIT 24 
#define PIN_ETMTRACECTL_R11_OUT_REG_OFFSET 17

#define PIN_GIOA_7_R11_OUT_MULTI_REG_BIT 27

#define PIN_GIOA_7_R11_OUT_REG_BIT 7
#define PIN_GIOA_7_R11_OUT_MULTI_REG_OFFSET 17
#define PIN_GIOA_7_R11_OUT_REG_OFFSET 0


#define PIN_FRAYTX1_B15_OUT_REG_BIT 0 
#define PIN_FRAYTX1_B15_OUT_REG_OFFSET 18

#define PIN_GIOA_2_B15_OUT_MULTI_REG_BIT 3

#define PIN_GIOA_2_B15_OUT_REG_BIT 2
#define PIN_GIOA_2_B15_OUT_MULTI_REG_OFFSET 18
#define PIN_GIOA_2_B15_OUT_REG_OFFSET 0


#define PIN_FRAYTX2_B8_OUT_REG_BIT 8 
#define PIN_FRAYTX2_B8_OUT_REG_OFFSET 18

#define PIN_GIOB_0_B8_OUT_MULTI_REG_BIT 11

#define PIN_GIOB_0_B8_OUT_REG_BIT 0
#define PIN_GIOB_0_B8_OUT_MULTI_REG_OFFSET 18
#define PIN_GIOB_0_B8_OUT_REG_OFFSET 1


#define PIN_FRAYTXEN1_B16_OUT_REG_BIT 16 
#define PIN_FRAYTXEN1_B16_OUT_REG_OFFSET 18

#define PIN_GIOB_1_B16_OUT_MULTI_REG_BIT 19

#define PIN_GIOB_1_B16_OUT_REG_BIT 1
#define PIN_GIOB_1_B16_OUT_MULTI_REG_OFFSET 18
#define PIN_GIOB_1_B16_OUT_REG_OFFSET 1


#define PIN_FRAYTXEN2_B9_OUT_REG_BIT 24 
#define PIN_FRAYTXEN2_B9_OUT_REG_OFFSET 18

#define PIN_GIOB_2_B9_OUT_MULTI_REG_BIT 27

#define PIN_GIOB_2_B9_OUT_REG_BIT 2
#define PIN_GIOB_2_B9_OUT_MULTI_REG_OFFSET 18
#define PIN_GIOB_2_B9_OUT_REG_OFFSET 1


#define PIN_GIOA_2_C1_OUT_MULTI_REG_BIT 0 

#define PIN_GIOA_2_C1_OUT_REG_BIT 2
#define PIN_GIOA_2_C1_OUT_MULTI_REG_OFFSET 19
#define PIN_GIOA_2_C1_OUT_REG_OFFSET 0


#define PIN_N2HET2_00_C1_OUT_MULTI_REG_BIT 2 

#define PIN_N2HET2_00_C1_OUT_REG_BIT 00
#define PIN_N2HET2_00_C1_OUT_MULTI_REG_OFFSET 19
#define PIN_N2HET2_00_C1_OUT_REG_OFFSET 2


#define PIN_eQEP2I_C1_OUT_REG_BIT 5
#define PIN_eQEP2I_C1_OUT_REG_OFFSET 19

#define PIN_GIOA_3_E1_OUT_MULTI_REG_BIT 8

#define PIN_GIOA_3_E1_OUT_REG_BIT 3
#define PIN_GIOA_3_E1_OUT_MULTI_REG_OFFSET 19
#define PIN_GIOA_3_E1_OUT_REG_OFFSET 0


#define PIN_N2HET2_02_E1_OUT_MULTI_REG_BIT 10

#define PIN_N2HET2_02_E1_OUT_REG_BIT 02
#define PIN_N2HET2_02_E1_OUT_MULTI_REG_OFFSET 19
#define PIN_N2HET2_02_E1_OUT_REG_OFFSET 2


#define PIN_GIOA_5_B5_OUT_MULTI_REG_BIT 16 

#define PIN_GIOA_5_B5_OUT_REG_BIT 5
#define PIN_GIOA_5_B5_OUT_MULTI_REG_OFFSET 19
#define PIN_GIOA_5_B5_OUT_REG_OFFSET 0


#define PIN_EXTCLKIN_B5_OUT_REG_BIT 19 
#define PIN_EXTCLKIN_B5_OUT_REG_OFFSET 19

#define PIN_ePWM1A_B5_OUT_REG_BIT 21
#define PIN_ePWM1A_B5_OUT_REG_OFFSET 19

#define PIN_GIOA_6_H3_OUT_MULTI_REG_BIT 24 

#define PIN_GIOA_6_H3_OUT_REG_BIT 6
#define PIN_GIOA_6_H3_OUT_MULTI_REG_OFFSET 19
#define PIN_GIOA_6_H3_OUT_REG_OFFSET 0


#define PIN_N2HET2_04_H3_OUT_MULTI_REG_BIT 26 

#define PIN_N2HET2_04_H3_OUT_REG_BIT 04
#define PIN_N2HET2_04_H3_OUT_MULTI_REG_OFFSET 19
#define PIN_N2HET2_04_H3_OUT_REG_OFFSET 2


#define PIN_ePWM1B_H3_OUT_REG_BIT 29
#define PIN_ePWM1B_H3_OUT_REG_OFFSET 19

#define PIN_GIOA_7_M1_OUT_MULTI_REG_BIT 0 

#define PIN_GIOA_7_M1_OUT_REG_BIT 7
#define PIN_GIOA_7_M1_OUT_MULTI_REG_OFFSET 20
#define PIN_GIOA_7_M1_OUT_REG_OFFSET 0


