leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET2_06_M1_OUT_MULTI_REG_BIT 2 

#define PIN_N2HET2_06_M1_OUT_REG_BIT 06
#define PIN_N2HET2_06_M1_OUT_MULTI_REG_OFFSET 20
#define PIN_N2HET2_06_M1_OUT_REG_OFFSET 2


#define PIN_ePWM2A_M1_OUT_REG_BIT 5
#define PIN_ePWM2A_M1_OUT_REG_OFFSET 20

#define PIN_GIOB_2_F2_OUT_MULTI_REG_BIT 8 

#define PIN_GIOB_2_F2_OUT_REG_BIT 2
#define PIN_GIOB_2_F2_OUT_MULTI_REG_OFFSET 20
#define PIN_GIOB_2_F2_OUT_REG_OFFSET 1


#define PIN_DCAN4TX_F2_OUT_REG_BIT 11
#define PIN_DCAN4TX_F2_OUT_REG_OFFSET 20

#define PIN_GIOB_3_W10_OUT_MULTI_REG_BIT 16 

#define PIN_GIOB_3_W10_OUT_REG_BIT 3
#define PIN_GIOB_3_W10_OUT_MULTI_REG_OFFSET 20
#define PIN_GIOB_3_W10_OUT_REG_OFFSET 1


#define PIN_DCAN4RX_W10_OUT_REG_BIT 19
#define PIN_DCAN4RX_W10_OUT_REG_OFFSET 20

#define PIN_GIOB_6_J2_OUT_MULTI_REG_BIT 24 

#define PIN_GIOB_6_J2_OUT_REG_BIT 6
#define PIN_GIOB_6_J2_OUT_MULTI_REG_OFFSET 20
#define PIN_GIOB_6_J2_OUT_REG_OFFSET 1


#define PIN_nERROR1_J2_OUT_REG_BIT 25
#define PIN_nERROR1_J2_OUT_REG_OFFSET 20

#define PIN_GIOB_7_F1_OUT_MULTI_REG_BIT 0 

#define PIN_GIOB_7_F1_OUT_REG_BIT 7
#define PIN_GIOB_7_F1_OUT_MULTI_REG_OFFSET 21
#define PIN_GIOB_7_F1_OUT_REG_OFFSET 1


#define PIN_nERROR2_F1_OUT_REG_BIT 1 
#define PIN_nERROR2_F1_OUT_REG_OFFSET 21

#define PIN_nTZ1_2_F1_OUT_REG_BIT 5
#define PIN_nTZ1_2_F1_OUT_REG_OFFSET 21

#define PIN_MIBSPI1NCS_0_R2_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI1NCS_0_R2_OUT_REG_BIT 0
#define PIN_MIBSPI1NCS_0_R2_OUT_MULTI_REG_OFFSET 21
#define PIN_MIBSPI1NCS_0_R2_OUT_REG_OFFSET 21


#define PIN_MIBSPI1SOMI_1_R2_OUT_MULTI_REG_BIT 9 

#define PIN_MIBSPI1SOMI_1_R2_OUT_REG_BIT 25
#define PIN_MIBSPI1SOMI_1_R2_OUT_MULTI_REG_OFFSET 21
#define PIN_MIBSPI1SOMI_1_R2_OUT_REG_OFFSET 21


#define PIN_MII_TXD_2_R2_OUT_REG_BIT 10 
#define PIN_MII_TXD_2_R2_OUT_REG_OFFSET 21

#define PIN_ECAP6_R2_OUT_REG_BIT 13
#define PIN_ECAP6_R2_OUT_REG_OFFSET 21

#define PIN_MIBSPI1NCS_1_F3_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI1NCS_1_F3_OUT_REG_BIT 1
#define PIN_MIBSPI1NCS_1_F3_OUT_MULTI_REG_OFFSET 21
#define PIN_MIBSPI1NCS_1_F3_OUT_REG_OFFSET 21


#define PIN_MII_COL_F3_OUT_REG_BIT 18 
#define PIN_MII_COL_F3_OUT_REG_OFFSET 21

#define PIN_N2HET1_17_F3_OUT_MULTI_REG_BIT 19 

#define PIN_N2HET1_17_F3_OUT_REG_BIT 17
#define PIN_N2HET1_17_F3_OUT_MULTI_REG_OFFSET 21
#define PIN_N2HET1_17_F3_OUT_REG_OFFSET 2


#define PIN_eQEP1S_F3_OUT_REG_BIT 21
#define PIN_eQEP1S_F3_OUT_REG_OFFSET 21

#define PIN_MIBSPI1NCS_2_G3_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI1NCS_2_G3_OUT_REG_BIT 2
#define PIN_MIBSPI1NCS_2_G3_OUT_MULTI_REG_OFFSET 21
#define PIN_MIBSPI1NCS_2_G3_OUT_REG_OFFSET 21


#define PIN_MDIO_G3_OUT_REG_BIT 26 
#define PIN_MDIO_G3_OUT_REG_OFFSET 21

#define PIN_N2HET1_19_G3_OUT_MULTI_REG_BIT 27

#define PIN_N2HET1_19_G3_OUT_REG_BIT 19
#define PIN_N2HET1_19_G3_OUT_MULTI_REG_OFFSET 21
#define PIN_N2HET1_19_G3_OUT_REG_OFFSET 2


#define PIN_MIBSPI1NCS_3_J3_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI1NCS_3_J3_OUT_REG_BIT 3
#define PIN_MIBSPI1NCS_3_J3_OUT_MULTI_REG_OFFSET 22
#define PIN_MIBSPI1NCS_3_J3_OUT_REG_OFFSET 22


#define PIN_N2HET1_21_J3_OUT_MULTI_REG_BIT 3 

#define PIN_N2HET1_21_J3_OUT_REG_BIT 21
#define PIN_N2HET1_21_J3_OUT_MULTI_REG_OFFSET 22
#define PIN_N2HET1_21_J3_OUT_REG_OFFSET 2


#define PIN_nTZ1_3_J3_OUT_REG_BIT 5
#define PIN_nTZ1_3_J3_OUT_REG_OFFSET 22

#define PIN_MIBSPI1NENA_G19_OUT_MULTI_REG_BIT 8

#define PIN_MIBSPI1NENA_G19_OUT_REG_BIT 8
#define PIN_MIBSPI1NENA_G19_OUT_MULTI_REG_OFFSET 22
#define PIN_MIBSPI1NENA_G19_OUT_REG_OFFSET 22


#define PIN_MII_RXD_2_G19_OUT_REG_BIT 10 
#define PIN_MII_RXD_2_G19_OUT_REG_OFFSET 22

#define PIN_N2HET1_23_G19_OUT_MULTI_REG_BIT 11 

#define PIN_N2HET1_23_G19_OUT_REG_BIT 23
#define PIN_N2HET1_23_G19_OUT_MULTI_REG_OFFSET 22
#define PIN_N2HET1_23_G19_OUT_REG_OFFSET 2


#define PIN_ECAP4_G19_OUT_REG_BIT 13
#define PIN_ECAP4_G19_OUT_REG_OFFSET 22

#define PIN_MIBSPI3CLK_V9_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI3CLK_V9_OUT_REG_BIT 9
#define PIN_MIBSPI3CLK_V9_OUT_MULTI_REG_OFFSET 22
#define PIN_MIBSPI3CLK_V9_OUT_REG_OFFSET 22


#define PIN_EXT_SEL_01_V9_OUT_REG_BIT 17
#define PIN_EXT_SEL_01_V9_OUT_REG_OFFSET 22

#define PIN_eQEP1A_V9_OUT_REG_BIT 21
#define PIN_eQEP1A_V9_OUT_REG_OFFSET 22

#define PIN_MIBSPI3NCS_0_V10_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI3NCS_0_V10_OUT_REG_BIT 0
#define PIN_MIBSPI3NCS_0_V10_OUT_MULTI_REG_OFFSET 22
#define PIN_MIBSPI3NCS_0_V10_OUT_REG_OFFSET 22


#define PIN_AD2EVT_V10_OUT_REG_BIT 25
#define PIN_AD2EVT_V10_OUT_REG_OFFSET 22

#define PIN_eQEP1I_V10_OUT_REG_BIT 29
#define PIN_eQEP1I_V10_OUT_REG_OFFSET 22

#define PIN_MIBSPI3NCS_1_V5_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI3NCS_1_V5_OUT_REG_BIT 1
#define PIN_MIBSPI3NCS_1_V5_OUT_MULTI_REG_OFFSET 23
#define PIN_MIBSPI3NCS_1_V5_OUT_REG_OFFSET 23


#define PIN_MDCLK_V5_OUT_REG_BIT 2 
#define PIN_MDCLK_V5_OUT_REG_OFFSET 23

#define PIN_N2HET1_25_V5_OUT_MULTI_REG_BIT 3

#define PIN_N2HET1_25_V5_OUT_REG_BIT 25
#define PIN_N2HET1_25_V5_OUT_MULTI_REG_OFFSET 23
#define PIN_N2HET1_25_V5_OUT_REG_OFFSET 2


#define PIN_MIBSPI3NCS_2_B2_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI3NCS_2_B2_OUT_REG_BIT 2
#define PIN_MIBSPI3NCS_2_B2_OUT_MULTI_REG_OFFSET 23
#define PIN_MIBSPI3NCS_2_B2_OUT_REG_OFFSET 23


#define PIN_I2C1_SDA_B2_OUT_REG_BIT 9 
#define PIN_I2C1_SDA_B2_OUT_REG_OFFSET 23

#define PIN_N2HET1_27_B2_OUT_MULTI_REG_BIT 11 

#define PIN_N2HET1_27_B2_OUT_REG_BIT 27
#define PIN_N2HET1_27_B2_OUT_MULTI_REG_OFFSET 23
#define PIN_N2HET1_27_B2_OUT_REG_OFFSET 2


#define PIN_nTZ1_2_B2_OUT_REG_BIT 13
#define PIN_nTZ1_2_B2_OUT_REG_OFFSET 23

#define PIN_MIBSPI3NCS_3_C3_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI3NCS_3_C3_OUT_REG_BIT 3
#define PIN_MIBSPI3NCS_3_C3_OUT_MULTI_REG_OFFSET 23
#define PIN_MIBSPI3NCS_3_C3_OUT_REG_OFFSET 23


#define PIN_I2C1_SCL_C3_OUT_REG_BIT 17
#define PIN_I2C1_SCL_C3_OUT_REG_OFFSET 23

#define PIN_N2HET1_29_C3_OUT_MULTI_REG_BIT 19 

#define PIN_N2HET1_29_C3_OUT_REG_BIT 29
#define PIN_N2HET1_29_C3_OUT_MULTI_REG_OFFSET 23
#define PIN_N2HET1_29_C3_OUT_REG_OFFSET 2


#define PIN_nTZ1_1_C3_OUT_REG_BIT 21
#define PIN_nTZ1_1_C3_OUT_REG_OFFSET 23

#define PIN_MIBSPI3NENA_W9_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI3NENA_W9_OUT_REG_BIT 8
#define PIN_MIBSPI3NENA_W9_OUT_MULTI_REG_OFFSET 23
#define PIN_MIBSPI3NENA_W9_OUT_REG_OFFSET 23


#define PIN_MIBSPI3NCS_5_W9_OUT_MULTI_REG_BIT 25 

