leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_MIBSPI3NCS_5_W9_OUT_REG_BIT 5
#define PIN_MIBSPI3NCS_5_W9_OUT_MULTI_REG_OFFSET 23
#define PIN_MIBSPI3NCS_5_W9_OUT_REG_OFFSET 23


#define PIN_N2HET1_31_W9_OUT_MULTI_REG_BIT 27

#define PIN_N2HET1_31_W9_OUT_REG_BIT 31
#define PIN_N2HET1_31_W9_OUT_MULTI_REG_OFFSET 23
#define PIN_N2HET1_31_W9_OUT_REG_OFFSET 2


#define PIN_eQEP1B_W9_OUT_REG_BIT 29
#define PIN_eQEP1B_W9_OUT_REG_OFFSET 23

#define PIN_MIBSPI3SIMO_W8_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI3SIMO_W8_OUT_REG_BIT 16
#define PIN_MIBSPI3SIMO_W8_OUT_MULTI_REG_OFFSET 24
#define PIN_MIBSPI3SIMO_W8_OUT_REG_OFFSET 24


#define PIN_EXT_SEL_00_W8_OUT_REG_BIT 1
#define PIN_EXT_SEL_00_W8_OUT_REG_OFFSET 24

#define PIN_ECAP3_W8_OUT_REG_BIT 5
#define PIN_ECAP3_W8_OUT_REG_OFFSET 24

#define PIN_MIBSPI3SOMI_V8_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI3SOMI_V8_OUT_REG_BIT 24
#define PIN_MIBSPI3SOMI_V8_OUT_MULTI_REG_OFFSET 24
#define PIN_MIBSPI3SOMI_V8_OUT_REG_OFFSET 24


#define PIN_EXT_ENA_V8_OUT_REG_BIT 9
#define PIN_EXT_ENA_V8_OUT_REG_OFFSET 24

#define PIN_ECAP2_V8_OUT_REG_BIT 13
#define PIN_ECAP2_V8_OUT_REG_OFFSET 24

#define PIN_MIBSPI5CLK_H19_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI5CLK_H19_OUT_REG_BIT 9
#define PIN_MIBSPI5CLK_H19_OUT_MULTI_REG_OFFSET 24
#define PIN_MIBSPI5CLK_H19_OUT_REG_OFFSET 24


#define PIN_DMM_DATA_04_H19_OUT_REG_BIT 17 
#define PIN_DMM_DATA_04_H19_OUT_REG_OFFSET 24

#define PIN_MII_TXEN_H19_OUT_REG_BIT 18 
#define PIN_MII_TXEN_H19_OUT_REG_OFFSET 24

#define PIN_RMII_TXEN_H19_OUT_REG_BIT 19
#define PIN_RMII_TXEN_H19_OUT_REG_OFFSET 24

#define PIN_MIBSPI5NCS_0_E19_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI5NCS_0_E19_OUT_REG_BIT 0
#define PIN_MIBSPI5NCS_0_E19_OUT_MULTI_REG_OFFSET 24
#define PIN_MIBSPI5NCS_0_E19_OUT_REG_OFFSET 24


#define PIN_DMM_DATA_05_E19_OUT_REG_BIT 25
#define PIN_DMM_DATA_05_E19_OUT_REG_OFFSET 24

#define PIN_ePWM4A_E19_OUT_REG_BIT 29
#define PIN_ePWM4A_E19_OUT_REG_OFFSET 24

#define PIN_MIBSPI5NCS_1_B6_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI5NCS_1_B6_OUT_REG_BIT 1
#define PIN_MIBSPI5NCS_1_B6_OUT_MULTI_REG_OFFSET 25
#define PIN_MIBSPI5NCS_1_B6_OUT_REG_OFFSET 25


#define PIN_DMM_DATA_06_B6_OUT_REG_BIT 1
#define PIN_DMM_DATA_06_B6_OUT_REG_OFFSET 25

#define PIN_MIBSPI5NCS_2_W6_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI5NCS_2_W6_OUT_REG_BIT 2
#define PIN_MIBSPI5NCS_2_W6_OUT_MULTI_REG_OFFSET 25
#define PIN_MIBSPI5NCS_2_W6_OUT_REG_OFFSET 25


#define PIN_DMM_DATA_02_W6_OUT_REG_BIT 9
#define PIN_DMM_DATA_02_W6_OUT_REG_OFFSET 25

#define PIN_MIBSPI5NCS_3_T12_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI5NCS_3_T12_OUT_REG_BIT 3
#define PIN_MIBSPI5NCS_3_T12_OUT_MULTI_REG_OFFSET 25
#define PIN_MIBSPI5NCS_3_T12_OUT_REG_OFFSET 25


#define PIN_DMM_DATA_03_T12_OUT_REG_BIT 17
#define PIN_DMM_DATA_03_T12_OUT_REG_OFFSET 25

#define PIN_MIBSPI5NENA_H18_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI5NENA_H18_OUT_REG_BIT 8
#define PIN_MIBSPI5NENA_H18_OUT_MULTI_REG_OFFSET 25
#define PIN_MIBSPI5NENA_H18_OUT_REG_OFFSET 25


#define PIN_DMM_DATA_07_H18_OUT_REG_BIT 25 
#define PIN_DMM_DATA_07_H18_OUT_REG_OFFSET 25

#define PIN_MII_RXD_3_H18_OUT_REG_BIT 26
#define PIN_MII_RXD_3_H18_OUT_REG_OFFSET 25

#define PIN_ECAP5_H18_OUT_REG_BIT 29
#define PIN_ECAP5_H18_OUT_REG_OFFSET 25

#define PIN_MIBSPI5SIMO_0_J19_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI5SIMO_0_J19_OUT_REG_BIT 16
#define PIN_MIBSPI5SIMO_0_J19_OUT_MULTI_REG_OFFSET 26
#define PIN_MIBSPI5SIMO_0_J19_OUT_REG_OFFSET 26


#define PIN_DMM_DATA_08_J19_OUT_REG_BIT 1 
#define PIN_DMM_DATA_08_J19_OUT_REG_OFFSET 26

#define PIN_MII_TXD_1_J19_OUT_REG_BIT 2 
#define PIN_MII_TXD_1_J19_OUT_REG_OFFSET 26

#define PIN_RMII_TXD_1_J19_OUT_REG_BIT 3
#define PIN_RMII_TXD_1_J19_OUT_REG_OFFSET 26

#define PIN_MIBSPI5SIMO_1_E16_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI5SIMO_1_E16_OUT_REG_BIT 17
#define PIN_MIBSPI5SIMO_1_E16_OUT_MULTI_REG_OFFSET 26
#define PIN_MIBSPI5SIMO_1_E16_OUT_REG_OFFSET 26


#define PIN_DMM_DATA_09_E16_OUT_REG_BIT 9
#define PIN_DMM_DATA_09_E16_OUT_REG_OFFSET 26

#define PIN_EXT_SEL_00_E16_OUT_REG_BIT 12
#define PIN_EXT_SEL_00_E16_OUT_REG_OFFSET 26

#define PIN_MIBSPI5SIMO_2_H17_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI5SIMO_2_H17_OUT_REG_BIT 18
#define PIN_MIBSPI5SIMO_2_H17_OUT_MULTI_REG_OFFSET 26
#define PIN_MIBSPI5SIMO_2_H17_OUT_REG_OFFSET 26


#define PIN_DMM_DATA_10_H17_OUT_REG_BIT 17
#define PIN_DMM_DATA_10_H17_OUT_REG_OFFSET 26

#define PIN_EXT_SEL_01_H17_OUT_REG_BIT 20
#define PIN_EXT_SEL_01_H17_OUT_REG_OFFSET 26

#define PIN_MIBSPI5SIMO_3_G17_OUT_MULTI_REG_BIT 24 

#define PIN_MIBSPI5SIMO_3_G17_OUT_REG_BIT 19
#define PIN_MIBSPI5SIMO_3_G17_OUT_MULTI_REG_OFFSET 26
#define PIN_MIBSPI5SIMO_3_G17_OUT_REG_OFFSET 26


#define PIN_DMM_DATA_11_G17_OUT_REG_BIT 25 
#define PIN_DMM_DATA_11_G17_OUT_REG_OFFSET 26

#define PIN_I2C2_SDA_G17_OUT_REG_BIT 26
#define PIN_I2C2_SDA_G17_OUT_REG_OFFSET 26

#define PIN_EXT_SEL_02_G17_OUT_REG_BIT 28
#define PIN_EXT_SEL_02_G17_OUT_REG_OFFSET 26

#define PIN_MIBSPI5SOMI_0_J18_OUT_MULTI_REG_BIT 0 

#define PIN_MIBSPI5SOMI_0_J18_OUT_REG_BIT 24
#define PIN_MIBSPI5SOMI_0_J18_OUT_MULTI_REG_OFFSET 27
#define PIN_MIBSPI5SOMI_0_J18_OUT_REG_OFFSET 27


#define PIN_DMM_DATA_12_J18_OUT_REG_BIT 1 
#define PIN_DMM_DATA_12_J18_OUT_REG_OFFSET 27

#define PIN_MII_TXD_0_J18_OUT_REG_BIT 2 
#define PIN_MII_TXD_0_J18_OUT_REG_OFFSET 27

#define PIN_RMII_TXD_0_J18_OUT_REG_BIT 3
#define PIN_RMII_TXD_0_J18_OUT_REG_OFFSET 27

#define PIN_MIBSPI5SOMI_1_E17_OUT_MULTI_REG_BIT 8 

#define PIN_MIBSPI5SOMI_1_E17_OUT_REG_BIT 25
#define PIN_MIBSPI5SOMI_1_E17_OUT_MULTI_REG_OFFSET 27
#define PIN_MIBSPI5SOMI_1_E17_OUT_REG_OFFSET 27


#define PIN_DMM_DATA_13_E17_OUT_REG_BIT 9
#define PIN_DMM_DATA_13_E17_OUT_REG_OFFSET 27

#define PIN_EXT_SEL_03_E17_OUT_REG_BIT 12
#define PIN_EXT_SEL_03_E17_OUT_REG_OFFSET 27

#define PIN_MIBSPI5SOMI_2_H16_OUT_MULTI_REG_BIT 16 

#define PIN_MIBSPI5SOMI_2_H16_OUT_REG_BIT 26
#define PIN_MIBSPI5SOMI_2_H16_OUT_MULTI_REG_OFFSET 27
#define PIN_MIBSPI5SOMI_2_H16_OUT_REG_OFFSET 27


#define PIN_DMM_DATA_14_H16_OUT_REG_BIT 17
#define PIN_DMM_DATA_14_H16_OUT_REG_OFFSET 27

#define PIN_EXT_SEL_04_H16_OUT_REG_BIT 20
#define PIN_EXT_SEL_04_H16_OUT_REG_OFFSET 27

#define PIN_MIBSPI5SOMI_3_G16_OUT_MULTI_REG_BIT 24 

