leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_MIBSPI5SOMI_3_G16_OUT_REG_BIT 27
#define PIN_MIBSPI5SOMI_3_G16_OUT_MULTI_REG_OFFSET 27
#define PIN_MIBSPI5SOMI_3_G16_OUT_REG_OFFSET 27


#define PIN_DMM_DATA_15_G16_OUT_REG_BIT 25 
#define PIN_DMM_DATA_15_G16_OUT_REG_OFFSET 27

#define PIN_I2C2_SCL_G16_OUT_REG_BIT 26
#define PIN_I2C2_SCL_G16_OUT_REG_OFFSET 27

#define PIN_EXT_ENA_G16_OUT_REG_BIT 28
#define PIN_EXT_ENA_G16_OUT_REG_OFFSET 27

#define PIN_N2HET1_00_K18_OUT_MULTI_REG_BIT 0 

#define PIN_N2HET1_00_K18_OUT_REG_BIT 00
#define PIN_N2HET1_00_K18_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET1_00_K18_OUT_REG_OFFSET 2


#define PIN_MIBSPI4CLK_K18_OUT_MULTI_REG_BIT 1

#define PIN_MIBSPI4CLK_K18_OUT_REG_BIT 9
#define PIN_MIBSPI4CLK_K18_OUT_MULTI_REG_OFFSET 28
#define PIN_MIBSPI4CLK_K18_OUT_REG_OFFSET 28


#define PIN_ePWM2B_K18_OUT_REG_BIT 5
#define PIN_ePWM2B_K18_OUT_REG_OFFSET 28

#define PIN_N2HET1_01_V2_OUT_MULTI_REG_BIT 8 

#define PIN_N2HET1_01_V2_OUT_REG_BIT 01
#define PIN_N2HET1_01_V2_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET1_01_V2_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NENA_V2_OUT_MULTI_REG_BIT 9

#define PIN_MIBSPI4NENA_V2_OUT_REG_BIT 8
#define PIN_MIBSPI4NENA_V2_OUT_MULTI_REG_OFFSET 28
#define PIN_MIBSPI4NENA_V2_OUT_REG_OFFSET 28


#define PIN_N2HET2_08_V2_OUT_MULTI_REG_BIT 11

#define PIN_N2HET2_08_V2_OUT_REG_BIT 08
#define PIN_N2HET2_08_V2_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET2_08_V2_OUT_REG_OFFSET 2


#define PIN_eQEP2A_V2_OUT_REG_BIT 13
#define PIN_eQEP2A_V2_OUT_REG_OFFSET 28

#define PIN_N2HET1_02_W5_OUT_MULTI_REG_BIT 16 

#define PIN_N2HET1_02_W5_OUT_REG_BIT 02
#define PIN_N2HET1_02_W5_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET1_02_W5_OUT_REG_OFFSET 2


#define PIN_MIBSPI4SIMO_W5_OUT_MULTI_REG_BIT 17

#define PIN_MIBSPI4SIMO_W5_OUT_REG_BIT 16
#define PIN_MIBSPI4SIMO_W5_OUT_MULTI_REG_OFFSET 28
#define PIN_MIBSPI4SIMO_W5_OUT_REG_OFFSET 28


#define PIN_ePWM3A_W5_OUT_REG_BIT 21
#define PIN_ePWM3A_W5_OUT_REG_OFFSET 28

#define PIN_N2HET1_03_U1_OUT_MULTI_REG_BIT 24 

#define PIN_N2HET1_03_U1_OUT_REG_BIT 03
#define PIN_N2HET1_03_U1_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET1_03_U1_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_0_U1_OUT_MULTI_REG_BIT 25

#define PIN_MIBSPI4NCS_0_U1_OUT_REG_BIT 0
#define PIN_MIBSPI4NCS_0_U1_OUT_MULTI_REG_OFFSET 28
#define PIN_MIBSPI4NCS_0_U1_OUT_REG_OFFSET 28


#define PIN_N2HET2_10_U1_OUT_MULTI_REG_BIT 27

#define PIN_N2HET2_10_U1_OUT_REG_BIT 10
#define PIN_N2HET2_10_U1_OUT_MULTI_REG_OFFSET 28
#define PIN_N2HET2_10_U1_OUT_REG_OFFSET 2


#define PIN_eQEP2B_U1_OUT_REG_BIT 29
#define PIN_eQEP2B_U1_OUT_REG_OFFSET 28

#define PIN_N2HET1_04_B12_OUT_MULTI_REG_BIT 0 

#define PIN_N2HET1_04_B12_OUT_REG_BIT 04
#define PIN_N2HET1_04_B12_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET1_04_B12_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_1_B12_OUT_MULTI_REG_BIT 1

#define PIN_MIBSPI4NCS_1_B12_OUT_REG_BIT 1
#define PIN_MIBSPI4NCS_1_B12_OUT_MULTI_REG_OFFSET 29
#define PIN_MIBSPI4NCS_1_B12_OUT_REG_OFFSET 29


#define PIN_ePWM4B_B12_OUT_REG_BIT 5
#define PIN_ePWM4B_B12_OUT_REG_OFFSET 29

#define PIN_N2HET1_05_V6_OUT_MULTI_REG_BIT 8 

#define PIN_N2HET1_05_V6_OUT_REG_BIT 05
#define PIN_N2HET1_05_V6_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET1_05_V6_OUT_REG_OFFSET 2


#define PIN_MIBSPI4SOMI_V6_OUT_MULTI_REG_BIT 9

#define PIN_MIBSPI4SOMI_V6_OUT_REG_BIT 24
#define PIN_MIBSPI4SOMI_V6_OUT_MULTI_REG_OFFSET 29
#define PIN_MIBSPI4SOMI_V6_OUT_REG_OFFSET 29


#define PIN_N2HET2_12_V6_OUT_MULTI_REG_BIT 11

#define PIN_N2HET2_12_V6_OUT_REG_BIT 12
#define PIN_N2HET2_12_V6_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET2_12_V6_OUT_REG_OFFSET 2


#define PIN_ePWM3B_V6_OUT_REG_BIT 13
#define PIN_ePWM3B_V6_OUT_REG_OFFSET 29

#define PIN_N2HET1_06_W3_OUT_MULTI_REG_BIT 16 

#define PIN_N2HET1_06_W3_OUT_REG_BIT 06
#define PIN_N2HET1_06_W3_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET1_06_W3_OUT_REG_OFFSET 2


#define PIN_SCI3RX_W3_OUT_REG_BIT 17
#define PIN_SCI3RX_W3_OUT_REG_OFFSET 29

#define PIN_ePWM5A_W3_OUT_REG_BIT 21
#define PIN_ePWM5A_W3_OUT_REG_OFFSET 29

#define PIN_N2HET1_07_T1_OUT_MULTI_REG_BIT 24 

#define PIN_N2HET1_07_T1_OUT_REG_BIT 07
#define PIN_N2HET1_07_T1_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET1_07_T1_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_2_T1_OUT_MULTI_REG_BIT 25

#define PIN_MIBSPI4NCS_2_T1_OUT_REG_BIT 2
#define PIN_MIBSPI4NCS_2_T1_OUT_MULTI_REG_OFFSET 29
#define PIN_MIBSPI4NCS_2_T1_OUT_REG_OFFSET 29


#define PIN_N2HET2_14_T1_OUT_MULTI_REG_BIT 27

#define PIN_N2HET2_14_T1_OUT_REG_BIT 14
#define PIN_N2HET2_14_T1_OUT_MULTI_REG_OFFSET 29
#define PIN_N2HET2_14_T1_OUT_REG_OFFSET 2


#define PIN_ePWM7B_T1_OUT_REG_BIT 29
#define PIN_ePWM7B_T1_OUT_REG_OFFSET 29

#define PIN_N2HET1_08_E18_OUT_MULTI_REG_BIT 0 

#define PIN_N2HET1_08_E18_OUT_REG_BIT 08
#define PIN_N2HET1_08_E18_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET1_08_E18_OUT_REG_OFFSET 2


#define PIN_MIBSPI1SIMO_1_E18_OUT_MULTI_REG_BIT 1 

#define PIN_MIBSPI1SIMO_1_E18_OUT_REG_BIT 17
#define PIN_MIBSPI1SIMO_1_E18_OUT_MULTI_REG_OFFSET 30
#define PIN_MIBSPI1SIMO_1_E18_OUT_REG_OFFSET 30


#define PIN_MII_TXD_3_E18_OUT_REG_BIT 2
#define PIN_MII_TXD_3_E18_OUT_REG_OFFSET 30

#define PIN_N2HET1_09_V7_OUT_MULTI_REG_BIT 8 

#define PIN_N2HET1_09_V7_OUT_REG_BIT 09
#define PIN_N2HET1_09_V7_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET1_09_V7_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_3_V7_OUT_MULTI_REG_BIT 9

#define PIN_MIBSPI4NCS_3_V7_OUT_REG_BIT 3
#define PIN_MIBSPI4NCS_3_V7_OUT_MULTI_REG_OFFSET 30
#define PIN_MIBSPI4NCS_3_V7_OUT_REG_OFFSET 30


#define PIN_N2HET2_16_V7_OUT_MULTI_REG_BIT 11

#define PIN_N2HET2_16_V7_OUT_REG_BIT 16
#define PIN_N2HET2_16_V7_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET2_16_V7_OUT_REG_OFFSET 2


#define PIN_ePWM7A_V7_OUT_REG_BIT 13
#define PIN_ePWM7A_V7_OUT_REG_OFFSET 30

#define PIN_N2HET1_10_D19_OUT_MULTI_REG_BIT 16 

#define PIN_N2HET1_10_D19_OUT_REG_BIT 10
#define PIN_N2HET1_10_D19_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET1_10_D19_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_4_D19_OUT_MULTI_REG_BIT 17 

