leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_MIBSPI4NCS_4_D19_OUT_REG_BIT 4
#define PIN_MIBSPI4NCS_4_D19_OUT_MULTI_REG_OFFSET 30
#define PIN_MIBSPI4NCS_4_D19_OUT_REG_OFFSET 30


#define PIN_MII_TX_CLK_D19_OUT_REG_BIT 18
#define PIN_MII_TX_CLK_D19_OUT_REG_OFFSET 30

#define PIN_nTZ1_3_D19_OUT_REG_BIT 21
#define PIN_nTZ1_3_D19_OUT_REG_OFFSET 30

#define PIN_N2HET1_11_E3_OUT_MULTI_REG_BIT 24 

#define PIN_N2HET1_11_E3_OUT_REG_BIT 11
#define PIN_N2HET1_11_E3_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET1_11_E3_OUT_REG_OFFSET 2


#define PIN_MIBSPI3NCS_4_E3_OUT_MULTI_REG_BIT 25

#define PIN_MIBSPI3NCS_4_E3_OUT_REG_BIT 4
#define PIN_MIBSPI3NCS_4_E3_OUT_MULTI_REG_OFFSET 30
#define PIN_MIBSPI3NCS_4_E3_OUT_REG_OFFSET 30


#define PIN_N2HET2_18_E3_OUT_MULTI_REG_BIT 27

#define PIN_N2HET2_18_E3_OUT_REG_BIT 18
#define PIN_N2HET2_18_E3_OUT_MULTI_REG_OFFSET 30
#define PIN_N2HET2_18_E3_OUT_REG_OFFSET 2


#define PIN_EPWM1SYNCO_E3_OUT_REG_BIT 29
#define PIN_EPWM1SYNCO_E3_OUT_REG_OFFSET 30

#define PIN_N2HET1_12_B4_OUT_MULTI_REG_BIT 0

#define PIN_N2HET1_12_B4_OUT_REG_BIT 12
#define PIN_N2HET1_12_B4_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET1_12_B4_OUT_REG_OFFSET 2


#define PIN_MIBSPI4NCS_5_B4_OUT_MULTI_REG_BIT 1

#define PIN_MIBSPI4NCS_5_B4_OUT_REG_BIT 5
#define PIN_MIBSPI4NCS_5_B4_OUT_MULTI_REG_OFFSET 31
#define PIN_MIBSPI4NCS_5_B4_OUT_REG_OFFSET 31


#define PIN_MII_CRS_B4_OUT_REG_BIT 2
#define PIN_MII_CRS_B4_OUT_REG_OFFSET 31

#define PIN_RMII_CRS_DV_B4_OUT_REG_BIT 3
#define PIN_RMII_CRS_DV_B4_OUT_REG_OFFSET 31

#define PIN_N2HET1_13_N2_OUT_MULTI_REG_BIT 8

#define PIN_N2HET1_13_N2_OUT_REG_BIT 13
#define PIN_N2HET1_13_N2_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET1_13_N2_OUT_REG_OFFSET 2


#define PIN_SCI3TX_N2_OUT_REG_BIT 9
#define PIN_SCI3TX_N2_OUT_REG_OFFSET 31

#define PIN_N2HET2_20_N2_OUT_MULTI_REG_BIT 11

#define PIN_N2HET2_20_N2_OUT_REG_BIT 20
#define PIN_N2HET2_20_N2_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET2_20_N2_OUT_REG_OFFSET 2


#define PIN_ePWM5B_N2_OUT_REG_BIT 13
#define PIN_ePWM5B_N2_OUT_REG_OFFSET 31

#define PIN_N2HET1_15_N1_OUT_MULTI_REG_BIT 16

#define PIN_N2HET1_15_N1_OUT_REG_BIT 15
#define PIN_N2HET1_15_N1_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET1_15_N1_OUT_REG_OFFSET 2


#define PIN_MIBSPI1NCS_4_N1_OUT_MULTI_REG_BIT 17

#define PIN_MIBSPI1NCS_4_N1_OUT_REG_BIT 4
#define PIN_MIBSPI1NCS_4_N1_OUT_MULTI_REG_OFFSET 31
#define PIN_MIBSPI1NCS_4_N1_OUT_REG_OFFSET 31


#define PIN_N2HET2_22_N1_OUT_MULTI_REG_BIT 19

#define PIN_N2HET2_22_N1_OUT_REG_BIT 22
#define PIN_N2HET2_22_N1_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET2_22_N1_OUT_REG_OFFSET 2


#define PIN_ECAP1_N1_OUT_REG_BIT 21
#define PIN_ECAP1_N1_OUT_REG_OFFSET 31

#define PIN_N2HET1_16_A4_OUT_MULTI_REG_BIT 24

#define PIN_N2HET1_16_A4_OUT_REG_BIT 16
#define PIN_N2HET1_16_A4_OUT_MULTI_REG_OFFSET 31
#define PIN_N2HET1_16_A4_OUT_REG_OFFSET 2


#define PIN_EPWM1SYNCI_A4_OUT_REG_BIT 27
#define PIN_EPWM1SYNCI_A4_OUT_REG_OFFSET 31

#define PIN_EPWM1SYNCO_A4_OUT_REG_BIT 29
#define PIN_EPWM1SYNCO_A4_OUT_REG_OFFSET 31

#define PIN_N2HET1_17_A13_OUT_MULTI_REG_BIT 0

#define PIN_N2HET1_17_A13_OUT_REG_BIT 17
#define PIN_N2HET1_17_A13_OUT_MULTI_REG_OFFSET 32
#define PIN_N2HET1_17_A13_OUT_REG_OFFSET 2


#define PIN_EMIF_nOE_A13_OUT_REG_BIT 1
#define PIN_EMIF_nOE_A13_OUT_REG_OFFSET 32

#define PIN_SCI4RX_A13_OUT_REG_BIT 2
#define PIN_SCI4RX_A13_OUT_REG_OFFSET 32

#define PIN_N2HET1_18_J1_OUT_MULTI_REG_BIT 8

#define PIN_N2HET1_18_J1_OUT_REG_BIT 18
#define PIN_N2HET1_18_J1_OUT_MULTI_REG_OFFSET 32
#define PIN_N2HET1_18_J1_OUT_REG_OFFSET 2


#define PIN_EMIF_RNW_J1_OUT_REG_BIT 9
#define PIN_EMIF_RNW_J1_OUT_REG_OFFSET 32

#define PIN_ePWM6A_J1_OUT_REG_BIT 13
#define PIN_ePWM6A_J1_OUT_REG_OFFSET 32

#define PIN_N2HET1_19_B13_OUT_MULTI_REG_BIT 16

#define PIN_N2HET1_19_B13_OUT_REG_BIT 19
#define PIN_N2HET1_19_B13_OUT_MULTI_REG_OFFSET 32
#define PIN_N2HET1_19_B13_OUT_REG_OFFSET 2


#define PIN_EMIF_nDQM_0_B13_OUT_REG_BIT 17
#define PIN_EMIF_nDQM_0_B13_OUT_REG_OFFSET 32

#define PIN_SCI4TX_B13_OUT_REG_BIT 18
#define PIN_SCI4TX_B13_OUT_REG_OFFSET 32

#define PIN_N2HET1_20_P2_OUT_MULTI_REG_BIT 24

#define PIN_N2HET1_20_P2_OUT_REG_BIT 20
#define PIN_N2HET1_20_P2_OUT_MULTI_REG_OFFSET 32
#define PIN_N2HET1_20_P2_OUT_REG_OFFSET 2


#define PIN_EMIF_nDQM_1_P2_OUT_REG_BIT 25
#define PIN_EMIF_nDQM_1_P2_OUT_REG_OFFSET 32

#define PIN_ePWM6B_P2_OUT_REG_BIT 29
#define PIN_ePWM6B_P2_OUT_REG_OFFSET 32

#define PIN_N2HET1_21_H4_OUT_MULTI_REG_BIT 0

#define PIN_N2HET1_21_H4_OUT_REG_BIT 21
#define PIN_N2HET1_21_H4_OUT_MULTI_REG_OFFSET 33
#define PIN_N2HET1_21_H4_OUT_REG_OFFSET 2


#define PIN_EMIF_nDQM_2_H4_OUT_REG_BIT 1
#define PIN_EMIF_nDQM_2_H4_OUT_REG_OFFSET 33

#define PIN_N2HET1_22_B3_OUT_MULTI_REG_BIT 8

#define PIN_N2HET1_22_B3_OUT_REG_BIT 22
#define PIN_N2HET1_22_B3_OUT_MULTI_REG_OFFSET 33
#define PIN_N2HET1_22_B3_OUT_REG_OFFSET 2


#define PIN_EMIF_nDQM_3_B3_OUT_REG_BIT 9
#define PIN_EMIF_nDQM_3_B3_OUT_REG_OFFSET 33

#define PIN_N2HET1_23_J4_OUT_MULTI_REG_BIT 16

#define PIN_N2HET1_23_J4_OUT_REG_BIT 23
#define PIN_N2HET1_23_J4_OUT_MULTI_REG_OFFSET 33
#define PIN_N2HET1_23_J4_OUT_REG_OFFSET 2


#define PIN_EMIF_BA_0_J4_OUT_REG_BIT 17
#define PIN_EMIF_BA_0_J4_OUT_REG_OFFSET 33

#define PIN_N2HET1_24_P1_OUT_MULTI_REG_BIT 24

#define PIN_N2HET1_24_P1_OUT_REG_BIT 24
#define PIN_N2HET1_24_P1_OUT_MULTI_REG_OFFSET 33
#define PIN_N2HET1_24_P1_OUT_REG_OFFSET 2


#define PIN_MIBSPI1NCS_5_P1_OUT_MULTI_REG_BIT 25

#define PIN_MIBSPI1NCS_5_P1_OUT_REG_BIT 5
#define PIN_MIBSPI1NCS_5_P1_OUT_MULTI_REG_OFFSET 33
#define PIN_MIBSPI1NCS_5_P1_OUT_REG_OFFSET 33


#define PIN_MII_RXD_0_P1_OUT_REG_BIT 26
#define PIN_MII_RXD_0_P1_OUT_REG_OFFSET 33

#define PIN_RMII_RXD_0_P1_OUT_REG_BIT 27
#define PIN_RMII_RXD_0_P1_OUT_REG_OFFSET 33

#define PIN_N2HET1_26_A14_OUT_MULTI_REG_BIT 0

#define PIN_N2HET1_26_A14_OUT_REG_BIT 26
#define PIN_N2HET1_26_A14_OUT_MULTI_REG_OFFSET 34
#define PIN_N2HET1_26_A14_OUT_REG_OFFSET 2


