leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_MII_RXD_1_A14_OUT_REG_BIT 2
#define PIN_MII_RXD_1_A14_OUT_REG_OFFSET 34

#define PIN_RMII_RXD_1_A14_OUT_REG_BIT 3
#define PIN_RMII_RXD_1_A14_OUT_REG_OFFSET 34

#define PIN_N2HET1_28_K19_OUT_MULTI_REG_BIT 8

#define PIN_N2HET1_28_K19_OUT_REG_BIT 28
#define PIN_N2HET1_28_K19_OUT_MULTI_REG_OFFSET 34
#define PIN_N2HET1_28_K19_OUT_REG_OFFSET 2


#define PIN_MII_RXCLK_K19_OUT_REG_BIT 10
#define PIN_MII_RXCLK_K19_OUT_REG_OFFSET 34

#define PIN_RMII_REFCLK_K19_OUT_REG_BIT 11
#define PIN_RMII_REFCLK_K19_OUT_REG_OFFSET 34

#define PIN_N2HET1_30_B11_OUT_MULTI_REG_BIT 16

#define PIN_N2HET1_30_B11_OUT_REG_BIT 30
#define PIN_N2HET1_30_B11_OUT_MULTI_REG_OFFSET 34
#define PIN_N2HET1_30_B11_OUT_REG_OFFSET 2


#define PIN_MII_RX_DV_B11_OUT_REG_BIT 18
#define PIN_MII_RX_DV_B11_OUT_REG_OFFSET 34

#define PIN_eQEP2S_B11_OUT_REG_BIT 21
#define PIN_eQEP2S_B11_OUT_REG_OFFSET 34

#define PIN_N2HET2_01_D8_OUT_MULTI_REG_BIT 24

#define PIN_N2HET2_01_D8_OUT_REG_BIT 01
#define PIN_N2HET2_01_D8_OUT_MULTI_REG_OFFSET 34
#define PIN_N2HET2_01_D8_OUT_REG_OFFSET 2


#define PIN_N2HET2_02_D7_OUT_MULTI_REG_BIT 0

#define PIN_N2HET2_02_D7_OUT_REG_BIT 02
#define PIN_N2HET2_02_D7_OUT_MULTI_REG_OFFSET 35
#define PIN_N2HET2_02_D7_OUT_REG_OFFSET 2


#define PIN_N2HET2_12_D3_OUT_MULTI_REG_BIT 8

#define PIN_N2HET2_12_D3_OUT_REG_BIT 12
#define PIN_N2HET2_12_D3_OUT_MULTI_REG_OFFSET 35
#define PIN_N2HET2_12_D3_OUT_REG_OFFSET 2


#define PIN_MIBSPI2NENA_D3_OUT_MULTI_REG_BIT 12

#define PIN_MIBSPI2NENA_D3_OUT_REG_BIT 8
#define PIN_MIBSPI2NENA_D3_OUT_MULTI_REG_OFFSET 35
#define PIN_MIBSPI2NENA_D3_OUT_REG_OFFSET 35


#define PIN_MIBSPI2NCS_1_D3_OUT_MULTI_REG_BIT 13

#define PIN_MIBSPI2NCS_1_D3_OUT_REG_BIT 1
#define PIN_MIBSPI2NCS_1_D3_OUT_MULTI_REG_OFFSET 35
#define PIN_MIBSPI2NCS_1_D3_OUT_REG_OFFSET 35


#define PIN_N2HET2_13_D2_OUT_MULTI_REG_BIT 16

#define PIN_N2HET2_13_D2_OUT_REG_BIT 13
#define PIN_N2HET2_13_D2_OUT_MULTI_REG_OFFSET 35
#define PIN_N2HET2_13_D2_OUT_REG_OFFSET 2


#define PIN_MIBSPI2SOMI_D2_OUT_MULTI_REG_BIT 20

#define PIN_MIBSPI2SOMI_D2_OUT_REG_BIT 24
#define PIN_MIBSPI2SOMI_D2_OUT_MULTI_REG_OFFSET 35
#define PIN_MIBSPI2SOMI_D2_OUT_REG_OFFSET 35


#define PIN_N2HET2_14_D1_OUT_MULTI_REG_BIT 24

#define PIN_N2HET2_14_D1_OUT_REG_BIT 14
#define PIN_N2HET2_14_D1_OUT_MULTI_REG_OFFSET 35
#define PIN_N2HET2_14_D1_OUT_REG_OFFSET 2


#define PIN_MIBSPI2SIMO_D1_OUT_MULTI_REG_BIT 28

#define PIN_MIBSPI2SIMO_D1_OUT_REG_BIT 16
#define PIN_MIBSPI2SIMO_D1_OUT_MULTI_REG_OFFSET 35
#define PIN_MIBSPI2SIMO_D1_OUT_REG_OFFSET 35


#define PIN_N2HET2_19_P4_OUT_MULTI_REG_BIT 0

#define PIN_N2HET2_19_P4_OUT_REG_BIT 19
#define PIN_N2HET2_19_P4_OUT_MULTI_REG_OFFSET 36
#define PIN_N2HET2_19_P4_OUT_REG_OFFSET 2


#define PIN_LIN2RX_P4_OUT_REG_BIT 1
#define PIN_LIN2RX_P4_OUT_REG_OFFSET 36

#define PIN_N2HET2_20_T5_OUT_MULTI_REG_BIT 8

#define PIN_N2HET2_20_T5_OUT_REG_BIT 20
#define PIN_N2HET2_20_T5_OUT_MULTI_REG_OFFSET 36
#define PIN_N2HET2_20_T5_OUT_REG_OFFSET 2


#define PIN_LIN2TX_T5_OUT_REG_BIT 9
#define PIN_LIN2TX_T5_OUT_REG_OFFSET 36

#define PIN_MII_RXCLK_T4_OUT_REG_BIT 16
#define PIN_MII_RXCLK_T4_OUT_REG_OFFSET 36

#define PIN_MII_TX_CLK_U7_OUT_REG_BIT 24
#define PIN_MII_TX_CLK_U7_OUT_REG_OFFSET 36

#define PIN_N2HET2_03_E2_OUT_MULTI_REG_BIT 0

#define PIN_N2HET2_03_E2_OUT_REG_BIT 03
#define PIN_N2HET2_03_E2_OUT_MULTI_REG_OFFSET 37
#define PIN_N2HET2_03_E2_OUT_REG_OFFSET 2


#define PIN_MIBSPI2CLK_E2_OUT_MULTI_REG_BIT 4

#define PIN_MIBSPI2CLK_E2_OUT_REG_BIT 9
#define PIN_MIBSPI2CLK_E2_OUT_MULTI_REG_OFFSET 37
#define PIN_MIBSPI2CLK_E2_OUT_REG_OFFSET 37


#define PIN_N2HET2_07_N3_OUT_MULTI_REG_BIT 8

#define PIN_N2HET2_07_N3_OUT_REG_BIT 07
#define PIN_N2HET2_07_N3_OUT_MULTI_REG_OFFSET 37
#define PIN_N2HET2_07_N3_OUT_REG_OFFSET 2


#define PIN_MIBSPI2NCS_0_N3_OUT_MULTI_REG_BIT 12

#define PIN_MIBSPI2NCS_0_N3_OUT_REG_BIT 0
#define PIN_MIBSPI2NCS_0_N3_OUT_MULTI_REG_OFFSET 37
#define PIN_MIBSPI2NCS_0_N3_OUT_REG_OFFSET 37




/* Inputs */
#define PIN_FUNCTION_AD2EVT_T10_IN PORT_FUNC0
#define PIN_FUNCTION_AD2EVT_V10_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP1_N1_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP2_V8_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP3_W8_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP4_G19_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP5_H18_IN PORT_FUNC1
#define PIN_FUNCTION_ECAP6_R2_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP1A_V9_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP1B_W9_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP1I_V10_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP1S_F3_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP2A_V2_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP2B_U1_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP2I_C1_IN PORT_FUNC1
#define PIN_FUNCTION_eQEP2S_B11_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_0_A5_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_0_R5_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_1_C2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_1_R6_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_2_C1_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_2_B15_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_3_E1_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_3_R7_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_4_A6_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_4_R8_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_5_B5_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_5_R9_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_6_H3_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_6_R10_IN PORT_FUNC1
#define PIN_FUNCTION_GIOA_7_M1_IN PORT_FUNC0
#define PIN_FUNCTION_GIOA_7_R11_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_0_M2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_0_B8_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_1_K2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_1_B16_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_2_F2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_2_B9_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_3_W10_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_3_R4_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_4_G1_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_4_L17_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_5_G2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_5_M17_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_6_J2_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_6_R3_IN PORT_FUNC1
#define PIN_FUNCTION_GIOB_7_F1_IN PORT_FUNC0
#define PIN_FUNCTION_GIOB_7_P3_IN PORT_FUNC1
#define PIN_FUNCTION_MDIO_F4_IN PORT_FUNC0
#define PIN_FUNCTION_MDIO_G3_IN PORT_FUNC1
#define PIN_FUNCTION_MIBSPI1NCS_4_U10_IN PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_4_N1_IN PORT_FUNC1
#define PIN_FUNCTION_MIBSPI1NCS_5_U9_IN PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_5_P1_IN PORT_FUNC1
#define PIN_FUNCTION_MIBSPI2NCS_1_D3_IN PORT_FUNC1
#define PIN_FUNCTION_MII_COL_W4_IN PORT_FUNC0
#define PIN_FUNCTION_MII_COL_F3_IN PORT_FUNC1
#define PIN_FUNCTION_MII_CRS_V4_IN PORT_FUNC0
#define PIN_FUNCTION_MII_CRS_B4_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RX_DV_U6_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RX_DV_B11_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RX_ER_U5_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RX_ER_N19_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RXCLK_T4_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RXCLK_K19_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_0_U4_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_0_P1_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_1_T3_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_1_A14_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_2_U3_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_2_G19_IN PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_3_V3_IN PORT_FUNC0
#define PIN_FUNCTION_MII_RXD_3_H18_IN PORT_FUNC1
#define PIN_FUNCTION_MII_TX_CLK_U7_IN PORT_FUNC0
#define PIN_FUNCTION_MII_TX_CLK_D19_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_17_A13_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_17_F3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_19_B13_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_19_G3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_21_H4_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_21_J3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_23_J4_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_23_G19_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_25_M3_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_25_V5_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_27_A9_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_27_B2_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_29_A3_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_29_C3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET1_31_J17_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET1_31_W9_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_00_D6_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_00_C1_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_01_D8_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_01_D4_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_02_D7_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_02_E1_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_03_E2_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_03_D5_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_04_D13_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_04_H3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_05_D12_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_05_D16_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_06_D11_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_06_M1_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_07_N3_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_07_N17_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_08_K16_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_08_V2_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_09_L16_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_09_K17_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_10_M16_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_10_U1_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_11_N16_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_11_C4_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_12_D3_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_12_V6_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_13_D2_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_13_C5_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_14_D1_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_14_T1_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_15_K4_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_15_C6_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_16_L4_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_16_V7_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_18_N4_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_18_E3_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_20_T5_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_20_N2_IN PORT_FUNC1
#define PIN_FUNCTION_N2HET2_22_T7_IN PORT_FUNC0
#define PIN_FUNCTION_N2HET2_22_N1_IN PORT_FUNC1
#define PIN_FUNCTION_nTZ1_1_N19_IN PORT_FUNC0
#define PIN_FUNCTION_nTZ1_1_C3_IN PORT_FUNC1
#define PIN_FUNCTION_nTZ1_2_F1_IN PORT_FUNC0
#define PIN_FUNCTION_nTZ1_2_B2_IN PORT_FUNC1
#define PIN_FUNCTION_nTZ1_3_J3_IN PORT_FUNC0
#define PIN_FUNCTION_nTZ1_3_D19_IN PORT_FUNC1

#define PIN_AD2EVT_T10_IN_REG_BIT 0
#define PIN_AD2EVT_T10_IN_REG_OFFSET 80

#define PIN_AD2EVT_V10_IN_REG_BIT 1
#define PIN_AD2EVT_V10_IN_REG_OFFSET 80

