leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_ECAP1_N1_IN_REG_BIT 9
#define PIN_ECAP1_N1_IN_REG_OFFSET 80

#define PIN_ECAP2_V8_IN_REG_BIT 17
#define PIN_ECAP2_V8_IN_REG_OFFSET 80

#define PIN_ECAP3_W8_IN_REG_BIT 25
#define PIN_ECAP3_W8_IN_REG_OFFSET 80

#define PIN_ECAP4_G19_IN_REG_BIT 1
#define PIN_ECAP4_G19_IN_REG_OFFSET 81

#define PIN_ECAP5_H18_IN_REG_BIT 9
#define PIN_ECAP5_H18_IN_REG_OFFSET 81

#define PIN_ECAP6_R2_IN_REG_BIT 17
#define PIN_ECAP6_R2_IN_REG_OFFSET 81

#define PIN_eQEP1A_V9_IN_REG_BIT 25
#define PIN_eQEP1A_V9_IN_REG_OFFSET 81

#define PIN_eQEP1B_W9_IN_REG_BIT 1
#define PIN_eQEP1B_W9_IN_REG_OFFSET 82

#define PIN_eQEP1I_V10_IN_REG_BIT 9
#define PIN_eQEP1I_V10_IN_REG_OFFSET 82

#define PIN_eQEP1S_F3_IN_REG_BIT 17
#define PIN_eQEP1S_F3_IN_REG_OFFSET 82

#define PIN_eQEP2A_V2_IN_REG_BIT 25
#define PIN_eQEP2A_V2_IN_REG_OFFSET 82

#define PIN_eQEP2B_U1_IN_REG_BIT 1
#define PIN_eQEP2B_U1_IN_REG_OFFSET 83

#define PIN_eQEP2I_C1_IN_REG_BIT 9
#define PIN_eQEP2I_C1_IN_REG_OFFSET 83

#define PIN_eQEP2S_B11_IN_REG_BIT 17
#define PIN_eQEP2S_B11_IN_REG_OFFSET 83

#define PIN_GIOA_0_A5_IN_MULTI_REG_BIT 24
#define PIN_GIOA_0_A5_IN_REG_BIT 0

#define PIN_GIOA_0_A5_IN_MULTI_REG_OFFSET 83
#define PIN_GIOA_0_A5_IN_REG_OFFSET 0


#define PIN_GIOA_0_R5_IN_MULTI_REG_BIT 25

#define PIN_GIOA_0_R5_IN_REG_BIT 0
#define PIN_GIOA_0_R5_IN_MULTI_REG_OFFSET 83
#define PIN_GIOA_0_R5_IN_REG_OFFSET 0


#define PIN_GIOA_1_C2_IN_MULTI_REG_BIT 0
#define PIN_GIOA_1_C2_IN_REG_BIT 1

#define PIN_GIOA_1_C2_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_1_C2_IN_REG_OFFSET 0


#define PIN_GIOA_1_R6_IN_MULTI_REG_BIT 1

#define PIN_GIOA_1_R6_IN_REG_BIT 1
#define PIN_GIOA_1_R6_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_1_R6_IN_REG_OFFSET 0


#define PIN_GIOA_2_C1_IN_MULTI_REG_BIT 8
#define PIN_GIOA_2_C1_IN_REG_BIT 2

#define PIN_GIOA_2_C1_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_2_C1_IN_REG_OFFSET 0


#define PIN_GIOA_2_B15_IN_MULTI_REG_BIT 9

#define PIN_GIOA_2_B15_IN_REG_BIT 2
#define PIN_GIOA_2_B15_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_2_B15_IN_REG_OFFSET 0


#define PIN_GIOA_3_E1_IN_MULTI_REG_BIT 16
#define PIN_GIOA_3_E1_IN_REG_BIT 3

#define PIN_GIOA_3_E1_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_3_E1_IN_REG_OFFSET 0


#define PIN_GIOA_3_R7_IN_MULTI_REG_BIT 17

#define PIN_GIOA_3_R7_IN_REG_BIT 3
#define PIN_GIOA_3_R7_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_3_R7_IN_REG_OFFSET 0


#define PIN_GIOA_4_A6_IN_MULTI_REG_BIT 24
#define PIN_GIOA_4_A6_IN_REG_BIT 4

#define PIN_GIOA_4_A6_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_4_A6_IN_REG_OFFSET 0


#define PIN_GIOA_4_R8_IN_MULTI_REG_BIT 25

#define PIN_GIOA_4_R8_IN_REG_BIT 4
#define PIN_GIOA_4_R8_IN_MULTI_REG_OFFSET 84
#define PIN_GIOA_4_R8_IN_REG_OFFSET 0


#define PIN_GIOA_5_B5_IN_MULTI_REG_BIT 0
#define PIN_GIOA_5_B5_IN_REG_BIT 5

#define PIN_GIOA_5_B5_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_5_B5_IN_REG_OFFSET 0


#define PIN_GIOA_5_R9_IN_MULTI_REG_BIT 1

#define PIN_GIOA_5_R9_IN_REG_BIT 5
#define PIN_GIOA_5_R9_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_5_R9_IN_REG_OFFSET 0


#define PIN_GIOA_6_H3_IN_MULTI_REG_BIT 8
#define PIN_GIOA_6_H3_IN_REG_BIT 6

#define PIN_GIOA_6_H3_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_6_H3_IN_REG_OFFSET 0


#define PIN_GIOA_6_R10_IN_MULTI_REG_BIT 9

#define PIN_GIOA_6_R10_IN_REG_BIT 6
#define PIN_GIOA_6_R10_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_6_R10_IN_REG_OFFSET 0


#define PIN_GIOA_7_M1_IN_MULTI_REG_BIT 16
#define PIN_GIOA_7_M1_IN_REG_BIT 7

#define PIN_GIOA_7_M1_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_7_M1_IN_REG_OFFSET 0


#define PIN_GIOA_7_R11_IN_MULTI_REG_BIT 17

#define PIN_GIOA_7_R11_IN_REG_BIT 7
#define PIN_GIOA_7_R11_IN_MULTI_REG_OFFSET 85
#define PIN_GIOA_7_R11_IN_REG_OFFSET 0


#define PIN_GIOB_0_M2_IN_MULTI_REG_BIT 24
#define PIN_GIOB_0_M2_IN_REG_BIT 0

#define PIN_GIOB_0_M2_IN_MULTI_REG_OFFSET 85
#define PIN_GIOB_0_M2_IN_REG_OFFSET 1


#define PIN_GIOB_0_B8_IN_MULTI_REG_BIT 25

#define PIN_GIOB_0_B8_IN_REG_BIT 0
#define PIN_GIOB_0_B8_IN_MULTI_REG_OFFSET 85
#define PIN_GIOB_0_B8_IN_REG_OFFSET 1


#define PIN_GIOB_1_K2_IN_MULTI_REG_BIT 0
#define PIN_GIOB_1_K2_IN_REG_BIT 1

#define PIN_GIOB_1_K2_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_1_K2_IN_REG_OFFSET 1


#define PIN_GIOB_1_B16_IN_MULTI_REG_BIT 1

#define PIN_GIOB_1_B16_IN_REG_BIT 1
#define PIN_GIOB_1_B16_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_1_B16_IN_REG_OFFSET 1


#define PIN_GIOB_2_F2_IN_MULTI_REG_BIT 8
#define PIN_GIOB_2_F2_IN_REG_BIT 2

#define PIN_GIOB_2_F2_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_2_F2_IN_REG_OFFSET 1


#define PIN_GIOB_2_B9_IN_MULTI_REG_BIT 9

#define PIN_GIOB_2_B9_IN_REG_BIT 2
#define PIN_GIOB_2_B9_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_2_B9_IN_REG_OFFSET 1


#define PIN_GIOB_3_W10_IN_MULTI_REG_BIT 16
#define PIN_GIOB_3_W10_IN_REG_BIT 3

#define PIN_GIOB_3_W10_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_3_W10_IN_REG_OFFSET 1


#define PIN_GIOB_3_R4_IN_MULTI_REG_BIT 17

#define PIN_GIOB_3_R4_IN_REG_BIT 3
#define PIN_GIOB_3_R4_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_3_R4_IN_REG_OFFSET 1


#define PIN_GIOB_4_G1_IN_MULTI_REG_BIT 24
#define PIN_GIOB_4_G1_IN_REG_BIT 4

#define PIN_GIOB_4_G1_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_4_G1_IN_REG_OFFSET 1


#define PIN_GIOB_4_L17_IN_MULTI_REG_BIT 25

#define PIN_GIOB_4_L17_IN_REG_BIT 4
#define PIN_GIOB_4_L17_IN_MULTI_REG_OFFSET 86
#define PIN_GIOB_4_L17_IN_REG_OFFSET 1


#define PIN_GIOB_5_G2_IN_MULTI_REG_BIT 0
#define PIN_GIOB_5_G2_IN_REG_BIT 5

#define PIN_GIOB_5_G2_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_5_G2_IN_REG_OFFSET 1


#define PIN_GIOB_5_M17_IN_MULTI_REG_BIT 1

#define PIN_GIOB_5_M17_IN_REG_BIT 5
#define PIN_GIOB_5_M17_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_5_M17_IN_REG_OFFSET 1


#define PIN_GIOB_6_J2_IN_MULTI_REG_BIT 8
#define PIN_GIOB_6_J2_IN_REG_BIT 6

#define PIN_GIOB_6_J2_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_6_J2_IN_REG_OFFSET 1


#define PIN_GIOB_6_R3_IN_MULTI_REG_BIT 9

#define PIN_GIOB_6_R3_IN_REG_BIT 6
#define PIN_GIOB_6_R3_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_6_R3_IN_REG_OFFSET 1


#define PIN_GIOB_7_F1_IN_MULTI_REG_BIT 16
#define PIN_GIOB_7_F1_IN_REG_BIT 7

#define PIN_GIOB_7_F1_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_7_F1_IN_REG_OFFSET 1


#define PIN_GIOB_7_P3_IN_MULTI_REG_BIT 17

#define PIN_GIOB_7_P3_IN_REG_BIT 7
#define PIN_GIOB_7_P3_IN_MULTI_REG_OFFSET 87
#define PIN_GIOB_7_P3_IN_REG_OFFSET 1


