leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_MDIO_F4_IN_REG_BIT 24
#define PIN_MDIO_F4_IN_REG_OFFSET 87

#define PIN_MDIO_G3_IN_REG_BIT 25
#define PIN_MDIO_G3_IN_REG_OFFSET 87

#define PIN_MIBSPI1NCS_4_U10_IN_MULTI_REG_BIT 0
#define PIN_MIBSPI1NCS_4_U10_IN_REG_BIT 4

#define PIN_MIBSPI1NCS_4_U10_IN_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_4_U10_IN_REG_OFFSET 88


#define PIN_MIBSPI1NCS_4_N1_IN_MULTI_REG_BIT 1

#define PIN_MIBSPI1NCS_4_N1_IN_REG_BIT 4
#define PIN_MIBSPI1NCS_4_N1_IN_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_4_N1_IN_REG_OFFSET 88


#define PIN_MIBSPI1NCS_5_U9_IN_MULTI_REG_BIT 8
#define PIN_MIBSPI1NCS_5_U9_IN_REG_BIT 5

#define PIN_MIBSPI1NCS_5_U9_IN_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_5_U9_IN_REG_OFFSET 88


#define PIN_MIBSPI1NCS_5_P1_IN_MULTI_REG_BIT 9

#define PIN_MIBSPI1NCS_5_P1_IN_REG_BIT 5
#define PIN_MIBSPI1NCS_5_P1_IN_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_5_P1_IN_REG_OFFSET 88


#define PIN_MIBSPI2NCS_1_D3_IN_MULTI_REG_BIT 17

#define PIN_MIBSPI2NCS_1_D3_IN_REG_BIT 1
#define PIN_MIBSPI2NCS_1_D3_IN_MULTI_REG_OFFSET 88
#define PIN_MIBSPI2NCS_1_D3_IN_REG_OFFSET 88


#define PIN_MII_COL_W4_IN_REG_BIT 16
#define PIN_MII_COL_W4_IN_REG_OFFSET 89

#define PIN_MII_COL_F3_IN_REG_BIT 17
#define PIN_MII_COL_F3_IN_REG_OFFSET 89

#define PIN_MII_CRS_V4_IN_REG_BIT 24
#define PIN_MII_CRS_V4_IN_REG_OFFSET 89

#define PIN_MII_CRS_B4_IN_REG_BIT 25
#define PIN_MII_CRS_B4_IN_REG_OFFSET 89

#define PIN_MII_RX_DV_U6_IN_REG_BIT 0
#define PIN_MII_RX_DV_U6_IN_REG_OFFSET 90

#define PIN_MII_RX_DV_B11_IN_REG_BIT 1
#define PIN_MII_RX_DV_B11_IN_REG_OFFSET 90

#define PIN_MII_RX_ER_U5_IN_REG_BIT 8
#define PIN_MII_RX_ER_U5_IN_REG_OFFSET 90

#define PIN_MII_RX_ER_N19_IN_REG_BIT 9
#define PIN_MII_RX_ER_N19_IN_REG_OFFSET 90

#define PIN_MII_RXCLK_T4_IN_REG_BIT 16
#define PIN_MII_RXCLK_T4_IN_REG_OFFSET 90

#define PIN_MII_RXCLK_K19_IN_REG_BIT 17
#define PIN_MII_RXCLK_K19_IN_REG_OFFSET 90

#define PIN_MII_RXD_0_U4_IN_REG_BIT 24
#define PIN_MII_RXD_0_U4_IN_REG_OFFSET 90

#define PIN_MII_RXD_0_P1_IN_REG_BIT 25
#define PIN_MII_RXD_0_P1_IN_REG_OFFSET 90

#define PIN_MII_RXD_1_T3_IN_REG_BIT 0
#define PIN_MII_RXD_1_T3_IN_REG_OFFSET 91

#define PIN_MII_RXD_1_A14_IN_REG_BIT 1
#define PIN_MII_RXD_1_A14_IN_REG_OFFSET 91

#define PIN_MII_RXD_2_U3_IN_REG_BIT 8
#define PIN_MII_RXD_2_U3_IN_REG_OFFSET 91

#define PIN_MII_RXD_2_G19_IN_REG_BIT 9
#define PIN_MII_RXD_2_G19_IN_REG_OFFSET 91

#define PIN_MII_RXD_3_V3_IN_REG_BIT 16
#define PIN_MII_RXD_3_V3_IN_REG_OFFSET 91

#define PIN_MII_RXD_3_H18_IN_REG_BIT 17
#define PIN_MII_RXD_3_H18_IN_REG_OFFSET 91

#define PIN_MII_TX_CLK_U7_IN_REG_BIT 24
#define PIN_MII_TX_CLK_U7_IN_REG_OFFSET 91

#define PIN_MII_TX_CLK_D19_IN_REG_BIT 25
#define PIN_MII_TX_CLK_D19_IN_REG_OFFSET 91

#define PIN_N2HET1_17_A13_IN_MULTI_REG_BIT 0
#define PIN_N2HET1_17_A13_IN_REG_BIT 17

#define PIN_N2HET1_17_A13_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_17_A13_IN_REG_OFFSET 2


#define PIN_N2HET1_17_F3_IN_MULTI_REG_BIT 1

#define PIN_N2HET1_17_F3_IN_REG_BIT 17
#define PIN_N2HET1_17_F3_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_17_F3_IN_REG_OFFSET 2


#define PIN_N2HET1_19_B13_IN_MULTI_REG_BIT 8
#define PIN_N2HET1_19_B13_IN_REG_BIT 19

#define PIN_N2HET1_19_B13_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_19_B13_IN_REG_OFFSET 2


#define PIN_N2HET1_19_G3_IN_MULTI_REG_BIT 9

#define PIN_N2HET1_19_G3_IN_REG_BIT 19
#define PIN_N2HET1_19_G3_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_19_G3_IN_REG_OFFSET 2


#define PIN_N2HET1_21_H4_IN_MULTI_REG_BIT 16
#define PIN_N2HET1_21_H4_IN_REG_BIT 21

#define PIN_N2HET1_21_H4_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_21_H4_IN_REG_OFFSET 2


#define PIN_N2HET1_21_J3_IN_MULTI_REG_BIT 17

#define PIN_N2HET1_21_J3_IN_REG_BIT 21
#define PIN_N2HET1_21_J3_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_21_J3_IN_REG_OFFSET 2


#define PIN_N2HET1_23_J4_IN_MULTI_REG_BIT 24
#define PIN_N2HET1_23_J4_IN_REG_BIT 23

#define PIN_N2HET1_23_J4_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_23_J4_IN_REG_OFFSET 2


#define PIN_N2HET1_23_G19_IN_MULTI_REG_BIT 25

#define PIN_N2HET1_23_G19_IN_REG_BIT 23
#define PIN_N2HET1_23_G19_IN_MULTI_REG_OFFSET 92
#define PIN_N2HET1_23_G19_IN_REG_OFFSET 2


#define PIN_N2HET1_25_M3_IN_MULTI_REG_BIT 0
#define PIN_N2HET1_25_M3_IN_REG_BIT 25

#define PIN_N2HET1_25_M3_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_25_M3_IN_REG_OFFSET 2


#define PIN_N2HET1_25_V5_IN_MULTI_REG_BIT 1

#define PIN_N2HET1_25_V5_IN_REG_BIT 25
#define PIN_N2HET1_25_V5_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_25_V5_IN_REG_OFFSET 2


#define PIN_N2HET1_27_A9_IN_MULTI_REG_BIT 8
#define PIN_N2HET1_27_A9_IN_REG_BIT 27

#define PIN_N2HET1_27_A9_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_27_A9_IN_REG_OFFSET 2


#define PIN_N2HET1_27_B2_IN_MULTI_REG_BIT 9

#define PIN_N2HET1_27_B2_IN_REG_BIT 27
#define PIN_N2HET1_27_B2_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_27_B2_IN_REG_OFFSET 2


#define PIN_N2HET1_29_A3_IN_MULTI_REG_BIT 16
#define PIN_N2HET1_29_A3_IN_REG_BIT 29

#define PIN_N2HET1_29_A3_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_29_A3_IN_REG_OFFSET 2


#define PIN_N2HET1_29_C3_IN_MULTI_REG_BIT 17

#define PIN_N2HET1_29_C3_IN_REG_BIT 29
#define PIN_N2HET1_29_C3_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_29_C3_IN_REG_OFFSET 2


#define PIN_N2HET1_31_J17_IN_MULTI_REG_BIT 24
#define PIN_N2HET1_31_J17_IN_REG_BIT 31

#define PIN_N2HET1_31_J17_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_31_J17_IN_REG_OFFSET 2


#define PIN_N2HET1_31_W9_IN_MULTI_REG_BIT 25

#define PIN_N2HET1_31_W9_IN_REG_BIT 31
#define PIN_N2HET1_31_W9_IN_MULTI_REG_OFFSET 93
#define PIN_N2HET1_31_W9_IN_REG_OFFSET 2


#define PIN_N2HET2_00_D6_IN_MULTI_REG_BIT 0
#define PIN_N2HET2_00_D6_IN_REG_BIT 00

#define PIN_N2HET2_00_D6_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_00_D6_IN_REG_OFFSET 2


#define PIN_N2HET2_00_C1_IN_MULTI_REG_BIT 1

#define PIN_N2HET2_00_C1_IN_REG_BIT 00
#define PIN_N2HET2_00_C1_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_00_C1_IN_REG_OFFSET 2


#define PIN_N2HET2_01_D8_IN_MULTI_REG_BIT 8
#define PIN_N2HET2_01_D8_IN_REG_BIT 01

#define PIN_N2HET2_01_D8_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_01_D8_IN_REG_OFFSET 2


#define PIN_N2HET2_01_D4_IN_MULTI_REG_BIT 9

