leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET2_01_D4_IN_REG_BIT 01
#define PIN_N2HET2_01_D4_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_01_D4_IN_REG_OFFSET 2


#define PIN_N2HET2_02_D7_IN_MULTI_REG_BIT 16
#define PIN_N2HET2_02_D7_IN_REG_BIT 02

#define PIN_N2HET2_02_D7_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_02_D7_IN_REG_OFFSET 2


#define PIN_N2HET2_02_E1_IN_MULTI_REG_BIT 17

#define PIN_N2HET2_02_E1_IN_REG_BIT 02
#define PIN_N2HET2_02_E1_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_02_E1_IN_REG_OFFSET 2


#define PIN_N2HET2_03_E2_IN_MULTI_REG_BIT 24
#define PIN_N2HET2_03_E2_IN_REG_BIT 03

#define PIN_N2HET2_03_E2_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_03_E2_IN_REG_OFFSET 2


#define PIN_N2HET2_03_D5_IN_MULTI_REG_BIT 25

#define PIN_N2HET2_03_D5_IN_REG_BIT 03
#define PIN_N2HET2_03_D5_IN_MULTI_REG_OFFSET 94
#define PIN_N2HET2_03_D5_IN_REG_OFFSET 2


#define PIN_N2HET2_04_D13_IN_MULTI_REG_BIT 0
#define PIN_N2HET2_04_D13_IN_REG_BIT 04

#define PIN_N2HET2_04_D13_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_04_D13_IN_REG_OFFSET 2


#define PIN_N2HET2_04_H3_IN_MULTI_REG_BIT 1

#define PIN_N2HET2_04_H3_IN_REG_BIT 04
#define PIN_N2HET2_04_H3_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_04_H3_IN_REG_OFFSET 2


#define PIN_N2HET2_05_D12_IN_MULTI_REG_BIT 8
#define PIN_N2HET2_05_D12_IN_REG_BIT 05

#define PIN_N2HET2_05_D12_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_05_D12_IN_REG_OFFSET 2


#define PIN_N2HET2_05_D16_IN_MULTI_REG_BIT 9

#define PIN_N2HET2_05_D16_IN_REG_BIT 05
#define PIN_N2HET2_05_D16_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_05_D16_IN_REG_OFFSET 2


#define PIN_N2HET2_06_D11_IN_MULTI_REG_BIT 16
#define PIN_N2HET2_06_D11_IN_REG_BIT 06

#define PIN_N2HET2_06_D11_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_06_D11_IN_REG_OFFSET 2


#define PIN_N2HET2_06_M1_IN_MULTI_REG_BIT 17

#define PIN_N2HET2_06_M1_IN_REG_BIT 06
#define PIN_N2HET2_06_M1_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_06_M1_IN_REG_OFFSET 2


#define PIN_N2HET2_07_N3_IN_MULTI_REG_BIT 24
#define PIN_N2HET2_07_N3_IN_REG_BIT 07

#define PIN_N2HET2_07_N3_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_07_N3_IN_REG_OFFSET 2


#define PIN_N2HET2_07_N17_IN_MULTI_REG_BIT 25

#define PIN_N2HET2_07_N17_IN_REG_BIT 07
#define PIN_N2HET2_07_N17_IN_MULTI_REG_OFFSET 95
#define PIN_N2HET2_07_N17_IN_REG_OFFSET 2


#define PIN_N2HET2_08_K16_IN_MULTI_REG_BIT 0
#define PIN_N2HET2_08_K16_IN_REG_BIT 08

#define PIN_N2HET2_08_K16_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_08_K16_IN_REG_OFFSET 2


#define PIN_N2HET2_08_V2_IN_MULTI_REG_BIT 1

#define PIN_N2HET2_08_V2_IN_REG_BIT 08
#define PIN_N2HET2_08_V2_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_08_V2_IN_REG_OFFSET 2


#define PIN_N2HET2_09_L16_IN_MULTI_REG_BIT 8
#define PIN_N2HET2_09_L16_IN_REG_BIT 09

#define PIN_N2HET2_09_L16_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_09_L16_IN_REG_OFFSET 2


#define PIN_N2HET2_09_K17_IN_MULTI_REG_BIT 9

#define PIN_N2HET2_09_K17_IN_REG_BIT 09
#define PIN_N2HET2_09_K17_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_09_K17_IN_REG_OFFSET 2


#define PIN_N2HET2_10_M16_IN_MULTI_REG_BIT 16
#define PIN_N2HET2_10_M16_IN_REG_BIT 10

#define PIN_N2HET2_10_M16_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_10_M16_IN_REG_OFFSET 2


#define PIN_N2HET2_10_U1_IN_MULTI_REG_BIT 17

#define PIN_N2HET2_10_U1_IN_REG_BIT 10
#define PIN_N2HET2_10_U1_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_10_U1_IN_REG_OFFSET 2


#define PIN_N2HET2_11_N16_IN_MULTI_REG_BIT 24
#define PIN_N2HET2_11_N16_IN_REG_BIT 11

#define PIN_N2HET2_11_N16_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_11_N16_IN_REG_OFFSET 2


#define PIN_N2HET2_11_C4_IN_MULTI_REG_BIT 25

#define PIN_N2HET2_11_C4_IN_REG_BIT 11
#define PIN_N2HET2_11_C4_IN_MULTI_REG_OFFSET 96
#define PIN_N2HET2_11_C4_IN_REG_OFFSET 2


#define PIN_N2HET2_12_D3_IN_MULTI_REG_BIT 0
#define PIN_N2HET2_12_D3_IN_REG_BIT 12

#define PIN_N2HET2_12_D3_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_12_D3_IN_REG_OFFSET 2


#define PIN_N2HET2_12_V6_IN_MULTI_REG_BIT 1

#define PIN_N2HET2_12_V6_IN_REG_BIT 12
#define PIN_N2HET2_12_V6_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_12_V6_IN_REG_OFFSET 2


#define PIN_N2HET2_13_D2_IN_MULTI_REG_BIT 8
#define PIN_N2HET2_13_D2_IN_REG_BIT 13

#define PIN_N2HET2_13_D2_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_13_D2_IN_REG_OFFSET 2


#define PIN_N2HET2_13_C5_IN_MULTI_REG_BIT 9

#define PIN_N2HET2_13_C5_IN_REG_BIT 13
#define PIN_N2HET2_13_C5_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_13_C5_IN_REG_OFFSET 2


#define PIN_N2HET2_14_D1_IN_MULTI_REG_BIT 16
#define PIN_N2HET2_14_D1_IN_REG_BIT 14

#define PIN_N2HET2_14_D1_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_14_D1_IN_REG_OFFSET 2


#define PIN_N2HET2_14_T1_IN_MULTI_REG_BIT 17

#define PIN_N2HET2_14_T1_IN_REG_BIT 14
#define PIN_N2HET2_14_T1_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_14_T1_IN_REG_OFFSET 2


#define PIN_N2HET2_15_K4_IN_MULTI_REG_BIT 24
#define PIN_N2HET2_15_K4_IN_REG_BIT 15

#define PIN_N2HET2_15_K4_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_15_K4_IN_REG_OFFSET 2


#define PIN_N2HET2_15_C6_IN_MULTI_REG_BIT 25

#define PIN_N2HET2_15_C6_IN_REG_BIT 15
#define PIN_N2HET2_15_C6_IN_MULTI_REG_OFFSET 97
#define PIN_N2HET2_15_C6_IN_REG_OFFSET 2


#define PIN_N2HET2_16_L4_IN_MULTI_REG_BIT 0
#define PIN_N2HET2_16_L4_IN_REG_BIT 16

#define PIN_N2HET2_16_L4_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_16_L4_IN_REG_OFFSET 2


#define PIN_N2HET2_16_V7_IN_MULTI_REG_BIT 1

#define PIN_N2HET2_16_V7_IN_REG_BIT 16
#define PIN_N2HET2_16_V7_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_16_V7_IN_REG_OFFSET 2


#define PIN_N2HET2_18_N4_IN_MULTI_REG_BIT 8
#define PIN_N2HET2_18_N4_IN_REG_BIT 18

#define PIN_N2HET2_18_N4_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_18_N4_IN_REG_OFFSET 2


#define PIN_N2HET2_18_E3_IN_MULTI_REG_BIT 9

#define PIN_N2HET2_18_E3_IN_REG_BIT 18
#define PIN_N2HET2_18_E3_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_18_E3_IN_REG_OFFSET 2


#define PIN_N2HET2_20_T5_IN_MULTI_REG_BIT 16
#define PIN_N2HET2_20_T5_IN_REG_BIT 20

#define PIN_N2HET2_20_T5_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_20_T5_IN_REG_OFFSET 2


