leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET2_20_N2_IN_MULTI_REG_BIT 17

#define PIN_N2HET2_20_N2_IN_REG_BIT 20
#define PIN_N2HET2_20_N2_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_20_N2_IN_REG_OFFSET 2


#define PIN_N2HET2_22_T7_IN_MULTI_REG_BIT 24
#define PIN_N2HET2_22_T7_IN_REG_BIT 22

#define PIN_N2HET2_22_T7_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_22_T7_IN_REG_OFFSET 2


#define PIN_N2HET2_22_N1_IN_MULTI_REG_BIT 25

#define PIN_N2HET2_22_N1_IN_REG_BIT 22
#define PIN_N2HET2_22_N1_IN_MULTI_REG_OFFSET 98
#define PIN_N2HET2_22_N1_IN_REG_OFFSET 2


#define PIN_nTZ1_1_N19_IN_REG_BIT 0
#define PIN_nTZ1_1_N19_IN_REG_OFFSET 99

#define PIN_nTZ1_1_C3_IN_REG_BIT 1
#define PIN_nTZ1_1_C3_IN_REG_OFFSET 99

#define PIN_nTZ1_2_F1_IN_REG_BIT 8
#define PIN_nTZ1_2_F1_IN_REG_OFFSET 99

#define PIN_nTZ1_2_B2_IN_REG_BIT 9
#define PIN_nTZ1_2_B2_IN_REG_OFFSET 99

#define PIN_nTZ1_3_J3_IN_REG_BIT 16
#define PIN_nTZ1_3_J3_IN_REG_OFFSET 99

#define PIN_nTZ1_3_D19_IN_REG_BIT 17
#define PIN_nTZ1_3_D19_IN_REG_OFFSET 99



/* Outputs */
#define PIN_FUNCTION_AD2EVT_T10_OUT PORT_FUNC0
#define PIN_AD2EVT_T10_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_AD2EVT_T10_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_GIOA_0_A5_OUT PORT_FUNC0
#define PIN_GIOA_0_A5_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_0_A5_OUT_REG_BIT 0

#define PIN_GIOA_0_A5_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_0_A5_OUT_REG_OFFSET 0


#define PIN_FUNCTION_GIOA_1_C2_OUT PORT_FUNC0
#define PIN_GIOA_1_C2_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_1_C2_OUT_REG_BIT 1

#define PIN_GIOA_1_C2_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_1_C2_OUT_REG_OFFSET 0


#define PIN_FUNCTION_GIOA_4_A6_OUT PORT_FUNC0
#define PIN_GIOA_4_A6_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_4_A6_OUT_REG_BIT 4

#define PIN_GIOA_4_A6_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOA_4_A6_OUT_REG_OFFSET 0


#define PIN_FUNCTION_GIOB_0_M2_OUT PORT_FUNC0
#define PIN_GIOB_0_M2_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_0_M2_OUT_REG_BIT 0

#define PIN_GIOB_0_M2_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_0_M2_OUT_REG_OFFSET 1


#define PIN_FUNCTION_GIOB_1_K2_OUT PORT_FUNC0
#define PIN_GIOB_1_K2_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_1_K2_OUT_REG_BIT 1

#define PIN_GIOB_1_K2_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_1_K2_OUT_REG_OFFSET 1


#define PIN_FUNCTION_GIOB_4_G1_OUT PORT_FUNC0
#define PIN_GIOB_4_G1_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_4_G1_OUT_REG_BIT 4

#define PIN_GIOB_4_G1_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_4_G1_OUT_REG_OFFSET 1


#define PIN_FUNCTION_GIOB_5_G2_OUT PORT_FUNC0
#define PIN_GIOB_5_G2_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_5_G2_OUT_REG_BIT 5

#define PIN_GIOB_5_G2_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_GIOB_5_G2_OUT_REG_OFFSET 1


#define PIN_FUNCTION_MDIO_F4_OUT PORT_FUNC0
#define PIN_MDIO_F4_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MDIO_F4_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MIBSPI1NCS_4_U10_OUT PORT_FUNC0
#define PIN_MIBSPI1NCS_4_U10_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1NCS_4_U10_OUT_REG_BIT 4

#define PIN_MIBSPI1NCS_4_U10_OUT_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_4_U10_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS


#define PIN_FUNCTION_MIBSPI1NCS_5_U9_OUT PORT_FUNC0
#define PIN_MIBSPI1NCS_5_U9_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MIBSPI1NCS_5_U9_OUT_REG_BIT 5

#define PIN_MIBSPI1NCS_5_U9_OUT_MULTI_REG_OFFSET 88
#define PIN_MIBSPI1NCS_5_U9_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS


#define PIN_FUNCTION_MII_COL_W4_OUT PORT_FUNC0
#define PIN_MII_COL_W4_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_COL_W4_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_CRS_V4_OUT PORT_FUNC0
#define PIN_MII_CRS_V4_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_CRS_V4_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RX_DV_U6_OUT PORT_FUNC0
#define PIN_MII_RX_DV_U6_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RX_DV_U6_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RX_ER_U5_OUT PORT_FUNC0
#define PIN_MII_RX_ER_U5_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RX_ER_U5_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RXD_0_U4_OUT PORT_FUNC0
#define PIN_MII_RXD_0_U4_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RXD_0_U4_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RXD_1_T3_OUT PORT_FUNC0
#define PIN_MII_RXD_1_T3_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RXD_1_T3_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RXD_2_U3_OUT PORT_FUNC0
#define PIN_MII_RXD_2_U3_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RXD_2_U3_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_MII_RXD_3_V3_OUT PORT_FUNC0
#define PIN_MII_RXD_3_V3_OUT_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_MII_RXD_3_V3_OUT_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS

#define PIN_FUNCTION_N2HET1_25_M3_OUT PORT_FUNC0
#define PIN_N2HET1_25_M3_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_25_M3_OUT_REG_BIT 25

#define PIN_N2HET1_25_M3_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_25_M3_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET1_27_A9_OUT PORT_FUNC0
#define PIN_N2HET1_27_A9_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_27_A9_OUT_REG_BIT 27

#define PIN_N2HET1_27_A9_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_27_A9_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET1_29_A3_OUT PORT_FUNC0
#define PIN_N2HET1_29_A3_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_29_A3_OUT_REG_BIT 29

#define PIN_N2HET1_29_A3_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_29_A3_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET1_31_J17_OUT PORT_FUNC0
#define PIN_N2HET1_31_J17_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_31_J17_OUT_REG_BIT 31

