leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570lc43x_portdefs.h
#define PIN_N2HET1_31_J17_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET1_31_J17_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_00_D6_OUT PORT_FUNC0
#define PIN_N2HET2_00_D6_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_00_D6_OUT_REG_BIT 00

#define PIN_N2HET2_00_D6_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_00_D6_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_04_D13_OUT PORT_FUNC0
#define PIN_N2HET2_04_D13_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_04_D13_OUT_REG_BIT 04

#define PIN_N2HET2_04_D13_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_04_D13_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_05_D12_OUT PORT_FUNC0
#define PIN_N2HET2_05_D12_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_05_D12_OUT_REG_BIT 05

#define PIN_N2HET2_05_D12_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_05_D12_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_06_D11_OUT PORT_FUNC0
#define PIN_N2HET2_06_D11_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_06_D11_OUT_REG_BIT 06

#define PIN_N2HET2_06_D11_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_06_D11_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_08_K16_OUT PORT_FUNC0
#define PIN_N2HET2_08_K16_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_08_K16_OUT_REG_BIT 08

#define PIN_N2HET2_08_K16_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_08_K16_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_09_L16_OUT PORT_FUNC0
#define PIN_N2HET2_09_L16_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_09_L16_OUT_REG_BIT 09

#define PIN_N2HET2_09_L16_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_09_L16_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_10_M16_OUT PORT_FUNC0
#define PIN_N2HET2_10_M16_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_10_M16_OUT_REG_BIT 10

#define PIN_N2HET2_10_M16_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_10_M16_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_11_N16_OUT PORT_FUNC0
#define PIN_N2HET2_11_N16_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_11_N16_OUT_REG_BIT 11

#define PIN_N2HET2_11_N16_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_11_N16_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_15_K4_OUT PORT_FUNC0
#define PIN_N2HET2_15_K4_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_15_K4_OUT_REG_BIT 15

#define PIN_N2HET2_15_K4_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_15_K4_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_16_L4_OUT PORT_FUNC0
#define PIN_N2HET2_16_L4_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_16_L4_OUT_REG_BIT 16

#define PIN_N2HET2_16_L4_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_16_L4_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_18_N4_OUT PORT_FUNC0
#define PIN_N2HET2_18_N4_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_18_N4_OUT_REG_BIT 18

#define PIN_N2HET2_18_N4_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_18_N4_OUT_REG_OFFSET 2


#define PIN_FUNCTION_N2HET2_22_T7_OUT PORT_FUNC0
#define PIN_N2HET2_22_T7_OUT_MULTI_REG_BIT PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_22_T7_OUT_REG_BIT 22

#define PIN_N2HET2_22_T7_OUT_MULTI_REG_OFFSET PORT_FUNC_USE_DEFAULT_SETTINGS
#define PIN_N2HET2_22_T7_OUT_REG_OFFSET 2


#endif /* TMS570LC43X_PORTDEFS_H_ */
